"""本模块存放所有设备的驱动
1、所有驱动继承自BaseDriver，类名统一为Driver，并要求实现open/close/read/write四个方法。样板见VirtualDevice
2、所有厂家提供的底层库，均放于driver/common内，各自新建文件夹分别放置


为避免IP地址冲突，采取以下IP段分配方案：
设备IP地址前两段为192.168
第三段分配如下（子网掩码均为255.255.255.0）：
101：示波器，如192.168.101.10，共254 # os
102：频谱仪，如192.168.102.10，共254 # sa
103：网分，如192.168.103.10，共254 # na
104-106：墨方，如192.168.105.10，共254*3 # mf
107-109：六合，如192.168.108.10，共254*3 # lh
110：泰克，如192.168.110.110，共254 # tk
111-115：耐数，如192.168.112.10，共254*5 # ns
116-120：芯跳(ChipQ)，如192.168.117.10，共254*5 # xt
121-125：中微达，如192.168.122.10，共254*5 # zw
126-127：微波源

199：其他设备 # ot

"""
# 重要提示：所有结尾.1的ip用于电脑设置，包括192.168.101.1，192.168.108.1
# 重要提示：所有结尾.1的ip用于电脑设置，包括192.168.101.1，192.168.108.1
# 重要提示：所有结尾.1的ip用于电脑设置，包括192.168.101.1，192.168.108.1

# 新增设备请点击（需要登录）：https://gitee.com/quarkstudio/iptable/edit/master/iptable.json
# 新增设备请点击（需要登录）：https://gitee.com/quarkstudio/iptable/edit/master/iptable.json
# 新增设备请点击（需要登录）：https://gitee.com/quarkstudio/iptable/edit/master/iptable.json
URL = "https://gitee.com/quarkstudio/iptable/edit/master/iptable.json"

""" 样例
ip编号：连续编号，到254需换到下一段，并从2开始继续编号
sn命名：设备缩写_分配ip段_末位ip地址，如na_103_10表示网分，地址为192.168.103.10

IPTABLE = {
    'os': { # 示波器,101
        'sn': '192.168.101.20'
    },
    
    'sa': { # 频谱仪,102
        'sn': '192.168.102.10'
    },
    
    'na': { # 网分,103
        'na_103_2': '192.168.103.2'
    },
    
    'mf': { # 墨方,104-106
        'sn': '192.168.102.10'
    },
    
    'lh': { # 六合,107-109
        'lh_107_2': '192.168.107.2',#LH_Trig 
        'lh_107_3': '192.168.107.3',#x86AD
    },
    
    'tk': { # 泰克,110
        'sn': '192.168.102.10'
    },
    
    'ns': { # 耐数,111-115
        'sn': '192.168.102.10'
    },
    
    'xt': { # 芯跳,116-120
        'sn': '192.168.102.10'
    },
    
    'zw': { # 中微达,121-125
        'zw_121_2': '192.168.121.2', 
        'zw_121_3': '192.168.121.3', 
    },
    
    'mw': { # 微波源,126-127
        'mw_126_2': '192.168.126.2',
        'mw_126_3': '192.168.126.3',
        'mw_126_4': '192.168.126.4',
        'mw_126_5': '192.168.126.5',
        'mw_126_6': '192.168.126.6',
    },
    'ot':{ # 其他设备,199
        'sn': '192.168.199.10'
    }
}
"""