# -*- coding: utf-8 -*-

import datetime #내장모듈

class basic_data:
	def terms(self):
		result = """
		2023-03-02 : 전반적으로 이름을 수정함
		0,0 : 왼쪽아래
		add : 기존에 있는것의 일반적인 끝에 넣는 것
		append : 맨끝에 추가할 때
		By_limit : 번호가 들어가 그때까지 적용
		By_step : 번호가 들어가 그 간격으로 실행될 때
		change : 입력값을 바꾸는 목적
		check : 확인
		color : 색넣기
		control : 어느 영역안에서 조정을 할 때
		cpx : 셀의 좌표번호
		curr_x : 키보드등으로 움직이는 현재의 셀
		current : 어떤 객체 든지 현재에 활성화된것을 뜻함
		data : 결과값으로 어떤 종류의 자료를 돌려줄 때
		delete : 삭제하기
		Dic : 자료의 형태가 dic형태로 줄때는 맨뒤에 dic을 붙임
		draw : 선을 그을 때 사용
		dtx : 두 셀간의 차이
		dx : 두지점간의 차이
		fill : 넣기
		Find : 찾기
		Get : 입력값이 없는 조건에서의 자료를 갖고올때 , read를 제외한 모든 자료를 갖고올 때
		index : 몇번째의 순서대로 어떤 것을 하는 것
		input : 내부적으로 어떤 값을 넣을 때
		Input_dic : 사전형식일 때
		Input_lisr1d : 1차원 리스트가 입력값일 때
		Input_list2d : 2차원 리스트가 입력값일 때
		Input_value : 숫자형의 자료가 입력될때
		Insert : 내가 원하는위치에 넣는 것
		make : 만들기
		Move : 이동하기
		mx, mpx : 마우스의 좌표
		New : 새로운것을 만드는 개념
		obj : 객체를 뜻함
		paint : 영역에 색칠하는 것
		pick : 여러개중에서 하나를 갖고올 때
		pwh : 넓이, 높이의 길이를 픽셀단위로 나타낸것
		px : 그림을 그리고 싶은 좌표, 커서의 픽셀 좌표
		Read : 입력값이 있으면서 어떤 자료를 갖고올 때 사용, 보여지는 자료의 값을 갖고올 때
		Replace : 바꾸기
		search : 찾기
		sel_x : 셀렉션된 영역
		select : 어떤 영역을 선택할 때
		set : 입력값이 특별한것없이 자료를 설정하는 것, 설정값을 변경할 때
		space_px : 기준이되는 것
		split : 분리하기
		tbl_x : 테이블의 x
		tx : cell의 번호에 대한것, table에서 몇번째 셀이라는 쯧
		win_x : 윈도우의 x
		Write : 눈에 보이는 것
		x, y : cell의 기본좌표, X: 가로줄번호, Y: 세로줄 번호
		xx : 가로줄의 영역, [3,6]
		xy : 하나의 셀에대한 좌표
		xyxy : 셀의 영역에 대한 좌표
		yy : 세로줄의 영역, [3,6]
		함수이름 : 액션_행위설명_범위_설명, Write_value_in_cell_by_limit
		"""
		return result

	def __init__(self):
		self.vars = {}

		self.vars["list_알파벳"] = "abcdefghijklmnopqrstuvwxyz"
		self.vars["list_자음"] = "ㄱㄴㄷㄹㅁㅂㅅㅇㅈㅊㅋㅌㅍㅎ"
		self.vars["list_모음"] ="ㅏㅑㅓㅕㅗㅛㅜㅠㅡㅣ"
		self.vars["list_자음_19"] = self.vars["first_letter"] = ["ㄱ", "ㄲ", "ㄴ", "ㄷ", "ㄸ", "ㄹ", "ㅁ", "ㅂ", "ㅃ", "ㅅ", "ㅆ", "ㅇ", "ㅈ", "ㅉ", "ㅊ", "ㅋ", "ㅌ", "ㅍ", "ㅎ"]  # 19 글자
		self.vars["list_모음_21"] = self.vars["second_letter"] = ["ㅏ", "ㅐ", "ㅑ", "ㅒ", "ㅓ", "ㅔ", "ㅕ", "ㅖ", "ㅗ", "ㅘ", "ㅙ", "ㅚ", "ㅛ", "ㅜ", "ㅝ", "ㅞ", "ㅟ", "ㅠ", "ㅡ", "ㅢ", "ㅣ"]  # 21 글자
		self.vars["list_받침_28"] = self.vars["third_letter"] = ["", "ㄱ", "ㄲ", "ㄳ", "ㄴ", "ㄵ", "ㄶ", "ㄷ", "ㄹ", "ㄺ", "ㄻ", "ㄼ", "ㄽ", "ㄾ", "ㄿ", "ㅀ", "ㅁ", "ㅂ", "ㅄ", "ㅅ", "ㅆ", "ㅇ", "ㅈ", "ㅊ", "ㅋ", "ㅌ", "ㅍ", "ㅎ"]  # 28 글자, 없는것 포함
		self.vars["list_가나다"] = "가나다라마바사아자차카타파하"
		self.vars["list_숫자"]= "1234567890"
		self.vars["list_그리스문자"]= "αβγδεζήθικλμνξόπρΣτ"
		self.vars["list_로마숫자"] = "ⅠⅡⅢⅣⅤⅥⅦⅧⅨⅩ"
		self.vars["list_원ㄱ"] = "㉠㉡㉢㉣㉤㉥㉦㉧㉨㉩㉪㉫㉬㉭"
		self.vars["list_원가"] = "㉮㉯㉰㉱㉲㉳㉴㉵㉶㉷㉸㉹㉺㉻"
		self.vars["list_원a"] = "ⒶⒷⒸⒹⒺⒻⒼⒽⒾⒿⓀⓁⓂⓃⓄⓅⓆⓇⓈⓉⓊⓋⓌⓍⓎⓏ"
		self.vars["list_원1"] ="⓪①②③④⑤⑥⑦⑧⑨⑩⑪⑫⑬⑭⑮⑯⑰⑱⑲⑳㉑㉒㉓㉔㉕㉖㉗㉘㉙㉚㉛㉜㉝㉞㉟㊱㊲㊳㊴㊵㊶㊷㊸㊹㊺㊻㊼㊽㊾㊿"
		self.vars["list_색강도"] = self.vars["basic_color_step"] = ["+++++", "++++", "+++", "++", "+", "", "-", "--", "---", "----", "-----"]

		self.vars["list_달력_서수_영어"] = self.vars["list_서수"] = ['1ST', '2ND', '3RD', '4TH', '5TH', '6TH', '7TH', '8TH', '9TH', '10TH', '11TH', '12TH', '13TH', '14TH', '15TH', '16TH', '17TH', '18TH', '19TH', '20TH', '21ST', '22ND', '23RD', '24TH', '25TH', '26TH', '27TH', '28TH', '29TH', '30TH', '31ST']
		self.vars["list_10까지_영어"] = self.vars["list_getdigit"] = ['one', 'two', 'three', 'four', 'five', 'six', 'seven', 'eight', 'nine']
		self.vars["list_10단위_영어"] = self.vars["list_num_eng_00digit"] = ['twenty', 'thirty', 'forty', 'fifty', 'sixty', 'seventy', 'eighty', 'ninety']
		self.vars["list_10_19_영어"] = self.vars["list_num_eng_10"] = ['ten', 'eleven', 'twelve', 'thirteen', 'fourteen', 'fifteen', 'sixteen', 'eighteen', 'nineteen']
		self.vars["list_1000_단위_영어"] = self.vars["list_num_eng_unit_1000"] = ['thousand', 'million', 'billion', 'trillion']
		self.vars["list_월이름_영어_short"] = self.vars["list_month_eng_short"] = ['JAN', 'FEB', 'MAR', 'APR', 'MAY', 'JUN', 'JUL', 'AUG', 'SEP', 'OCT', 'NOV', 'DEC']
		self.vars["list_월이름_영어"] = self.vars["list_month_eng"] = ['JANUARY', 'FEBRUARY', 'MARCH', 'APRIL', 'MAY', 'JUNE', 'JULY', 'AUGUST', 'SEPTEMBER', 'OCTOBER', 'NOVEMBER', 'DECEMBER']

		self.vars["list_색이름_기본12가지_영어"] = self.vars["color_name_for_basic_12_eng"] = ['red', 'ora', 'yel', 'gre_yel', 'gre', 'gre_cya', 'cya', 'blu_cya', 'blu', 'blu_mag', 'pin', 'red_mag']
		self.vars["list_색이름_영어"] = self.vars["list_colorname_eng"] = ["red", "ora", "yel", "gre_yel", "gre", "gre_cya", "cya", "blu_cya", "blu", "blu_mag", "mag", "red_mag", "gra", "whi", "bla"]
		self.vars["list_색이름_영어_short"] = self.vars["list_colorname_eng_short"] = ["r", "o", "y", "gre_yel", "g", "gre_cya", "c", "blu_cya", "b", "blu_mag", "m", "red_mag", "g", "w", "bl"]
		self.vars["list_색이름_기본12가지_한글"] = self.vars["color_name_for_basic_12_kor"] = ['빨강', '오렌지', '노랑', '연두', '초록', '연초록', '하늘', '군청색', '파랑', '남색', '핑크', '자주']
		self.vars["list_색이름_한글"] = self.vars["list_colorname_kor"] = ["빨강", "주황", "노랑", "연두", "초록", "연초록", "옥색", "청록", "파랑", "남색", "보라", "자홍", "회색", "흰색", "검정"]

		self.vars["list_색스타일_영어"] = self.vars["list_colorstyle_eng"] = ["white", "pale", "light", "soft", "vivid", "dull", "deep", "dark", "black", "gray"]
		self.vars["list_색스타일_영어_1"] = self.vars["list_colorstyle_eng"] = ["vivid", "bright", "strong", "deep", "light", "soft", "dull", "dark", "pale", "lightgrayish", "grayish", "darkgrayish"]
		self.vars["list_색톤_영어"] = self.vars["color_tone_eng"] =["pale", "light_grayish", "grayish", "dark_grayish", "light", "soft", "dull", "dark", "bright", "strong", "deep", "vivid"]
		self.vars["list_색톤"] = self.vars["list_colorstyle_kor"] = ["파스텔", "연한", "밝은", "흐린", "선명한", "기본", "탁한", "진한", "어두운", "회색", "검은", "검정"]
		self.vars["list_색톤_1"] = self.vars["color_tone_kor"] = ["연한", "밝은회색", "회색", "어두운회색", "옅은", "부드러운", "탁한", "어두운", "밝은", "강한", "짙은", "선명한"]

		self.vars["list_pccs_색이름"] = self.vars["list_colorname_pccs"] = ["v", "b", "s", "dp", "lt", "sf", "d", "dk", "p", "ltg", "g", "dkg"]
		self.vars["list_currency_eng_last"] = ['no', 'one', 'dollars']
		self.vars["list_num_last_cent"] = ['only', 'and one cent', 'and', 'cents']

		self.vars["list_기본12색_rgb"] = self.vars["list_basic_12rgb"] = [[255, 0, 0], [255, 128, 0], [255, 255, 0], [128, 255, 0],	[0, 255, 0], [0, 255, 128], [0, 255, 255], [0, 128, 255], [0, 0, 255], [128, 0, 255], [255, 0, 255], [255, 0, 128], ]
		self.vars["list_기본12색_hsl"] = self.vars["list_basic_12hsl"] = [[0, 100, 50], [30, 100, 50], [60, 100, 50], [90, 100, 50], [120, 100, 50],	 [150, 100, 50], [180, 100, 50], [210, 100, 50], [240, 100, 50], [270, 100, 50], [300, 100, 50], [330, 100, 50]]
		self.vars["list_12단계_h값"] = self.vars["list_basic_12h"] = [0, 30, 60, 90, 120, 150, 180, 210, 240, 270, 300, 330]
		self.vars["list_10단계_sl값"] = self.vars["list_basic_10sl"] = [[100, 0], [90, 10], [80, 20], [70, 30], [60, 40], [50, 50], [40, 60], [30, 70], [10, 80], [10, 90], [0, 100]]
		self.vars["list_11단계_sl값"] = self.vars["list_basic_11sl"] = [[100, 0], [100, 10], [100, 20], [100, 30], [100, 40], [100, 50], [100, 60], [100, 70], [100, 80], [100, 90], [100, 100]]
		self.vars["list_12단계_칼라스타일"] = self.vars["list_basic_12colorstyle"] = [[90, 50], [80, 30], [80, 50], [80, 70], [50, 20], [50, 40], [50, 60], [50, 80], [20, 20], [20, 40], [20, 60], [20, 80]]
		self.vars["list_faber_스타일_sl값"] = self.vars["sl_no_for_faber_style"] = [[[100, 0], [100, 50], [0, 0]], [[0, 0], [0, 75], [0, 100]],[[100, 0], [25, 75], [0, 100]], [[25, 0], [10, 50], [0, 75]], [[100, 0], [0, 0], [0, 100]], [[25, 0], [10, 50], [0, 75], [25, 75]], ]
		self.vars["list_12가지톤_sl값"] = self.vars["sl_no_for_12_color_tone"] = [[90, 50], [80, 30], [80, 50], [80, 70], [50, 20], [50, 40], [50, 60], [50, 80], [20, 20], [20, 40], [20, 60], [20, 80]]
		self.vars["list_12단계_색스타일_sl값"] = self.vars["list_colorstyle_slno"] = [[90, 50], [80, 30], [80, 50], [80, 70], [50, 20], [50, 40], [50, 60], [50, 80], [20, 20], [20, 40], [20, 60], [20, 80]]
		self.vars["list_10단계_sl값"] = self.vars["sl_no_for_basic_10"] = [[100, 0], [90, 10], [80, 20], [70, 30], [60, 40], [50, 50], [40, 60], [30, 70], [10, 80], [10, 90], [0, 100]]
		self.vars["list_12단계_hsl값"] = self.vars["hsl_no_for_basic_12"] = [[0, 100, 50], [30, 100, 50], [60, 100, 50], [90, 100, 50], [120, 100, 50], [150, 100, 50], [180, 100, 50], [210, 100, 50], [240, 100, 50], [270, 100, 50], [300, 100, 50], [330, 100, 50]]
		self.vars["list_11단계_sl값"] = self.vars["sl_no_for_basic_11"] = [[100, 0], [100, 10], [100, 20], [100, 30], [100, 40], [100, 50], [100, 60], [100, 70], [100, 80], [100, 90], [100, 100]]
		self.vars["list_12단계_rgb값"] = self.vars["rgb_46_for_excel"] = [[255, 0, 0], [255, 128, 0], [255, 255, 0], [128, 255, 0],	[0, 255, 0], [0, 255, 128], [0, 255, 255], [0, 128, 255],	[0, 0, 255], [128, 0, 255], [255, 0, 255], [255, 0, 128], ]
		self.vars["list_12단계_h값"] =self.vars["h_no_for_basic_12"] =[0, 30, 60, 90, 120, 150, 180, 210, 240, 270, 300, 330]

		self.vars["dic_자음_vs_번호"] = self.vars["first_letter_no"] = {"ㄱ":0, "ㄲ":1, "ㄴ":2, "ㄷ":3, "ㄸ":4, "ㄹ":5, "ㅁ":6, "ㅂ":7, "ㅃ":8, "ㅅ":9, "ㅆ":10, "ㅇ":11, "ㅈ":12, "ㅉ":13, "ㅊ":14, "ㅋ":15, "ㅌ":16, "ㅍ":17, "ㅎ":18}  # 19 글자
		self.vars["dic_모음_vs_번호"] = self.vars["second_letter_no"] = {"ㅏ":0, "ㅐ":1, "ㅑ":2, "ㅒ":3, "ㅓ":4, "ㅔ":5, "ㅕ":6, "ㅖ":7, "ㅗ":8, "ㅘ":9, "ㅙ":10, "ㅚ":11, "ㅛ":12, "ㅜ":13, "ㅝ":14, "ㅞ":15, "ㅟ":16, "ㅠ":17, "ㅡ":18, "ㅢ":19, "ㅣ":20}  # 21 글자
		self.vars["dic_받침_vs_번호"] = self.vars["third_letter_no"] = {"":0, "ㄱ":1, "ㄲ":2, "ㄳ":3, "ㄴ":4, "ㄵ":5, "ㄶ":6, "ㄷ":7, "ㄹ":8, "ㄺ":9, "ㄻ":10, "ㄼ":11, "ㄽ":12, "ㄾ":13, "ㄿ":14, "ㅀ":15,"ㅁ":16, "ㅂ":17, "ㅄ":18, "ㅅ":19, "ㅆ":20, "ㅇ":21, "ㅈ":22, "ㅊ":23, "ㅋ":24, "ㅌ":25, "ㅍ":26, "ㅎ":27}  # 28 글자, 없는것 포함
		self.vars["dic_색톤_12가지_vs_번호"] = self.vars["color_tone_12_kor_vs_index"] = {"연한": 0, "밝은회색": 1, "회색": 2, "어두운회색": 3, "옅은": 4, "부드러운": 5, "탁한": 6, "어두운": 7, "밝은": 8, "강한": 9, "짙은": 10, "선명한": 11}
		self.vars["dic_색톤_영어_vs_sl값"] = self.vars["color_tone_simple_eng_vs_sl_no"] = {"pastel": [100, 85],"p": [25, 85], "ltg": [25, 65], "g": [25, 35], "dkg": [25, 15],"lt": [50, 80], "sf": [50, 60], "d": [50, 40], "dk": [50, 20],"s": [70, 50], "b": [75, 75], "dp": [75, 25],	"v": [90, 50],}
		self.vars["dic_선위치_vs_번호"] = self.vars["dic_lineposition_num_forexcel"] = {"/": 6, "\\": 5, "left": 7, "top": 8, "bottom": 9, "right": 10, "inside-h": 11, "inside-v": 12, "대각선오른쪽": 6, "대각선왼쪽": 5, "왼쪽": 7, "위쪽": 8, "아래쪽": 9, "오른쪽": 10, "안쪽세로": 11, "안쪽가로": 12, }
		self.vars["dic_선굵기_vs_번호"] = self.vars["excel_line_thickness_dic"] = {"-": -4115, "-.": 4, "-..": 5, ".": -4118, "=": -4119, "no": -4142, "/.": 13, "실선": 1, "점선": 2, "가는점선": 1, "굵은실선": 6, "hairline": 1, "basic": -4138, "thick": 4, "thin": 2, "t-2": 1, "t0": -4138, "t1": 4, "t-1": 2, "매우가는선": 1, "일반": -4138, "굵은선": 4, "가는선": 2, "": 1, "..": -4115, "/..": 13,"2": 4, "1": 2,}
		self.vars["dic_선형태_vs_번호"] = self.vars["dic_linestyle_num_forexcel"] = {"basic": 1, "-": -4115, "-.": 4, "-..": 5, ".": -4118, "=": -4119, "no": -4142, "/.": 13, "실선": 1, "점선": 2, "가는점선": 1, "굵은실선": 6, }

		self.vars["dic_선형태_vs_번호"] = self.vars["dic_excel_line_style_vs_value"] = {"basic": 1, "": 1, "-": 1, ".": -4118, "-.": 4, "-..": 5, "..": -4115, "=": 4119, "no": -4142, "/..": 13, }
		self.vars["dic_색이름_영어_vs_h값"] = self.vars["dic_colorname_hnum"] =  {"red": 0, "ora": 30, "yel": 60, "gre_yel": 90, "gre": 120, "gre_cya": 150 , "cya": 180, "blu_cya": 210, "blu": 240, "blu_mag": 270, "mag": 300, "red_mag": 330, "gra": 0, "whi": 0, "bla": 0, }
		self.vars["dic_색이름_영어_vs_h값"] = self.vars["color_name_eng_vs_h_no"] = {"red": 0, "ora": 30, "yel": 60, "gre_yel": 90, "gre": 120, "gre_cya": 150 , "cya": 180, "blu_cya": 210, "blu": 240, "blu_mag": 270, "mag": 300, "red_mag": 330, "gra": 0, "whi": 0, "bla": 0, "pin": 326, }
		self.vars["dic_색이름_영어_vs_번호"] = self.vars["color_name_eng_vs_index"] = {"red": 0, "ora": 1, "yel": 2, "gre_yel": 3, "gre": 4, "gre_cya": 5, "cya": 6, "blu_cya": 7, "blu": 8, "blu_mag": 9, "mag": 10, "red_mag": 11, "gra": 12, "whi": 13, "bla": 14}
		self.vars["dic_색이름_영어_vs_번호"] = self.vars["dic_color_name_eng_vs_color_index"] = {"red": 0, "ora": 1, "yel": 2, "yg": 3, "gre": 4, "gre_cya": 5, "cya": 6, "cb": 7, "blu": 8, "blu_mag": 9, "mag": 10, "mr": 11, "gra": 12, "whi": 13, "bla": 14}
		self.vars["dic_sl값_큰단계_vs_sl값"] = self.vars["dic_num_slstep"] =  {"1": [100, 80], "2": [100, 77], "3": [100, 68], "4": [100, 59],"5": [100, 50], "6": [90, 41], "7": [80, 32], "8": [70, 23], "9": [60, 14] }
		self.vars["dic_sl값_작은단계_vs_sl값"] = self.vars["dic_num_slstep_small"] =  {"1": [0, 12], "2": [0, 9], "3": [0, 6], "4": [0, 3],"5": [0, 0], "6": [0, -3], "7": [0, -6], "8": [0, -9], "9": [0, -12], "0": [0, -14], }
		self.vars["dic_월이름_영어_vs_번호"] = self.vars["mon_eng_vs_no"] = {"JAN":1, "FEB":2, "MAR":3, "APR":4, "MAY":5, "JUN":6, "JUL":7, "AUG":8, "SEP":9, "OCT":10, "NOV":11, "DEC":12, "JANUARY":1, "FEBRUARY":2, "MARCH":3, "APRIL":4, "JUNE":6, "JULY":7, "AUGUST":8,"SEPTEMBER":9, "OCTOBER":10, "NOVEMBER":11, "DECEMBER":12}
		self.vars["dic_색강도_vs_sl값"] = self.vars["+-_value_vs_sl_no"] = {"+++++": [0, 15], "++++": [0, 12], "+++": [0, 9], "++": [0, 6], "+": [0, 3], "-": [0, -3],"--": [0, -6], "---": [0, -9], "----": [0, -12], "-----": [0, -14], }
		self.vars["dic_번호_vs_s단계"] = self.vars["dic_num_sstep"] = {"1": [10], "2": [20], "3": [30], "4": [40], "5": [50], "6": [60], "7": [70], "8": [80], "9": [90], }
		self.vars["dic_번호_vs_l단계"] = self.vars["dic_num_lstep"] = {"1": [10], "2": [20], "3": [30], "4": [40], "5": [50], "6": [60], "7": [70], "8": [80], "9": [90], }

		self.vars["dic_색이름_한글_vs_색이름_영어"] = self.vars["check_color_name_eng"] = self.vars["check_color_name"]={
			"빨": "red", "적": "red", "빨강": "red", "red": "red", "r": "red", "빨간색": "red", "빨강색": "red",
			"주": "ora", "주황": "ora", "주황색": "ora", "오렌지": "ora", "yr": "ora", "yellowred": "ora", "yellow_red": "ora", "yel_red": "ora", "yellow red": "ora", "o": "ora", "orange": "ora", "ora": "ora",
			"노": "yel", "노랑": "yel", "노랑색": "yel", "황색": "yel", "y": "yel", "yellow": "yel", "yel": "yel",
			"연": "gre_yel", "연두": "gre_yel", "연두색": "gre_yel", "gre_yel": "gre_yel", "gy": "gre_yel", "greenyellow": "gre_yel", "green_yellow": "gre_yel", "green yellow": "gre_yel", "green-yellow": "gre_yel", "yg": "gre_yel",
			"초": "gre", "초록": "gre", "초록색": "gre", "g": "gre", "green": "gre", "gre": "gre", "녹색": "gre",
			"연초록": "gre_cya", "gre_cya": "gre_cya", "greencyan": "gre_cya", "green_cyan": "gre_cya", "green cyan": "gre_cya", "cg": "gre_cya", "gc": "gre_cya",
			"옥": "cya", "옥색": "cya", "하늘색": "cya", "하늘": "cya", "c": "cya", "cya": "cya", "cyan": "cya",
			"청록": "blu_cya", "청록색": "blu_cya", "청": "blu_cya", "군청색": "blu_cya", "청색": "blu_cya", "blu_cya": "blu_cya", "bluecyan": "blu_cya", "blue_cyan": "blu_cya", "blue cyan": "blu_cya", "cb": "blu_cya", "bg": "blu_cya", "bluegreen": "blu_cya", "bc": "blu_cya",
			"파": "blu", "파랑": "blu", "파랑색": "blu", "b": "blu", "blue": "blu", "blu": "blu",
			"남": "blu_mag", "남색": "blu_mag", "blu_mag": "blu_mag", "bluemagenta": "blu_mag", "blue_magenta": "blu_mag", "blue magenta": "blu_mag", "bm": "blu_mag", "pb": "blu_mag", "purpleblue": "blu_mag", "purple_blue": "blu_mag", "purple blue": "blu_mag",
			"핑크": "pin", "핑크색": "pin", "분홍": "pin", "분홍색": "pin", "pink": "pin","pin": "pin",
			"자홍": "red_mag", "자주": "red_mag", "자주색": "red_mag", "redmagenta": "red_mag",  "red_mag": "red_mag", "red_magenta": "red_mag", "red magenta": "red_mag", "rm": "red_mag", "mr": "red_mag",
			"보": "mag", "보라": "mag", "보라색": "mag", "magenta": "mag", "m": "mag", "mag": "mag", "purple": "mag", "자색": "mag", "violet": "mag", "vio": "mag",
			"회": "gra", "회색": "gra", "gra": "gra", "gray": "gra",
			"흰": "whi", "하양": "whi", "하양색": "whi", "하얀색": "whi", "흰색": "whi", "white": "whi", "whi": "whi",
			"검": "bla", "검정": "bla", "검정색": "bla", "흑": "bla", "흑색": "bla", "black": "bla", "bla": "bla",
			"갈색": "bro", "brown": "bro", "bro": "bro",
			"주홍": "sca", "sca": "sca", "scarlet": "sca", "주홍색": "sca", "선홍색": "sca", "선홍": "sca",
			"연분홍": "pal_pin", "pale_pink": "pal_pin", "pal_pin": "pal_pin",
			"유황색": "sul_yel", "유황": "sul_yel","sul_yel": "sul_yel",
		}

		self.vars["dic_색이름_vs_한글색이름"] = self.vars["check_color_name_kor"] = {
			"빨": "빨강", "적": "빨강", "red": "빨강", "r": "빨강", "빨간색": "빨강", "빨강색": "빨강","빨강": "빨강",
			"주": "오렌지", "주황": "오렌지", "주황색": "오렌지", "ora": "오렌지", "yr": "오렌지", "yellowred": "오렌지", "yellow_red": "오렌지", "yel_red": "오렌지", "yellow red": "오렌지", "o": "오렌지", "orange": "오렌지",
			"노": "노랑", "노랑": "노랑", "노랑색": "노랑", "황색": "노랑", "y": "노랑", "yellow": "노랑", "yel": "노랑",
			"연": "연두", "연두": "연두", "연두색": "연두", "gy": "연두", "greenyellow": "연두", "green_yellow": "연두", "gre_yel": "연두", "green yellow": "연두", "green-yellow": "연두", "yg": "연두",
			"초": "초록", "초록": "초록", "초록색": "초록", "g": "초록", "녹색": "초록",
			"연초록": "연초록", "greencyan": "연초록", "green_cyan": "연초록", "gre_cya": "연초록", "green cyan": "연초록", "cg": "연초록", "gc": "연초록",
			"옥": "하늘", "옥색": "하늘", "하늘색": "하늘", "하늘": "하늘", "c": "하늘", "cya": "하늘", "cyan": "하늘",
			"청록": "군청색", "청록색": "군청색", "청": "군청색", "군청색": "군청색", "청색": "군청색", "bluecyan": "군청색", "blue_cyan": "군청색", "blu_cya": "군청색", "blue cyan": "군청색", "cb": "군청색", "bg": "군청색", "bluegreen": "군청색",
			"파": "파랑", "파랑": "파랑", "파랑색": "파랑", "b": "파랑", "blue": "파랑", "blu": "파랑",
			"남": "남색", "남색": "남색", "bluemagenta": "남색", "blue_magenta": "남색", "blu_mag": "남색", "blue magenta": "남색", "bm": "남색", "pb": "남색", "purpleblue": "남색", "purple_blue": "남색", "pur_blu": "남색", "purple blue": "남색",
			"핑크": "핑크", "핑크색": "핑크", "분홍": "핑크", "분홍색": "핑크", "pink": "핑크",
			"자홍": "자주", "자주": "자주", "자주색": "자주", "redmagenta": "자주", "red_mag": "자주", "red_magenta": "자주", "red magenta": "자주", "rm": "자주", "mr": "자주",
			"보": "보라", "보라": "보라", "보라색": "보라", "magenta": "보라", "m": "보라", "mag": "보라", "purple": "보라", "자색": "보라", "violet": "보라", "vio": "보라",
			"회": "회색", "회색": "회색", "gra": "회색", "gray": "회색",
			"흰": "하양", "하양": "하양", "하양색": "하양", "하얀색": "하양", "흰색": "하양", "white": "하양", "whi": "하양",
			"검": "검정", "검정": "검정", "검정색": "검정", "흑": "검정", "흑색": "검정", "black": "검정", "bla": "검정",
			"갈색": "갈색", "brown": "갈색", "bro": "갈색",
			"주홍": "주홍", "scarlet": "주홍","sca": "주홍", "주홍색": "주홍", "선홍색": "주홍", "선홍": "주홍",
			"연분홍": "연분홍", "pale_pink": "연분홍","pal_pin": "연분홍",
			"유황색": "유황", "유황": "유황","sulphur_yellow": "유황","sul_yel": "유황",
		}

		self.vars["dic_색이름_영어_vs_기본_hsl_값"] = self.vars["color_name_eng_vs_hsl_no"] = {
			"gra": [0, 0, 50], 	"whi": [0, 0, 100], "bla": [0, 0, 0], 	"red": [0, 100, 50],
			"ora": [30, 100, 50], "yel": [60, 100, 50], "gre_yel": [90, 100, 50], 	"gre": [120, 100, 50],
			"gre_cya": [150, 100, 50], "cya": [180, 100, 50], "blu_cya": [210, 100, 50], "blu": [240, 100, 50],
			"blu_mag": [270, 100, 50], "mag": [300, 100, 50], "red_mag": [330, 100, 50], "pin": [326, 75, 56],
			"bro": [30, 100, 40], "sca": [181, 0, 16],	"pal_pin": [348, 95, 84],	"sul_yel": [150, 75, 0],
		}

		self.vars["dic_색톤_vs_기본_색톤_영어"] = self.vars["check_color_tone"] = {
			"파스텔": "pastel", "pastel": "pastel",
			"p": "p", "pale": "p", "pal": "p", "연한": "p",
			"ltg": "ltg", "light_grayish": "ltg", "gra+": "ltg", "밝은회색": "ltg",
			"g": "g", "grayish": "g", "gra": "g", "회색": "g",
			"dkg": "dkg", "dark_grayish": "dkg", "gra-": "dkg", "어두운회색": "dkg",
			"lt": "lt", "light": "lt", "lig": "lt", "옅은": "lt",
			"sf": "sf", "soft": "sf", "sof": "sf", "부드러운": "sf",
			"d": "d", "dull": "d", "dul": "d", "탁한": "d",
			"dk": "dk", "dark": "dk", "dar": "dk", "어두운": "dk",
			"b": "b", "bright": "b", "bri": "b", "밝은": "b",
			"s": "s", "strong": "s", "str": "s", "기본": "s", "강한": "s",
			"dp": "dp", "deep": "dp", "dee": "dp", "짙은": "dp",
			"v": "v", "선명한": "v", "vivid": "v", "viv": "v",
			"black": "black", "검정": "black",
			}

		self.vars["dic_색강도_vs_기본값"] = self.vars["check_change_step"] ={
			0: "0", "0": "0", "l5": "0", "+++++": "0", "pale": "0", "p": "0", "pastel": "0", "파스텔": "0", "d5": "0",
			1: "1", "1": "1", "l4": "1", "++++": "1", "light_grayish": "1", "ltg": "1", "밝은회색": "1", "d4": "1",
			2: "2", "2": "2", "l3": "2", "+++": "2", "light": "2", "lt": "2", "흐린": "2", "옅은": "2", "d3": "2",
			3: "3", "3": "3", "l2": "3", "++": "3", "soft": "3", "sf": "3", "부드러운": "3", "d2": "3",
			4: "4", "4": "4", "l1": "4", "+": "4", "bright": "4", "b": "4", "밝은": "4", "d1": "4",
			5: "5", "5": "5", "l0": "5", "": "5", "strong": "5", "s": "5", "강한": "5", "d0": "5",
			6: "6", "6": "6", "l-1": "6", "-": "6", "deep": "6", "dp": "6", "진한": "6", "d-1": "6",
			7: "7", "7": "7", "l-2": "7", "--": "7", "dull": "7", "d": "7", "탁한": "7", "d-2": "7",
			8: "8", "8": "8", "l-3": "8", "---": "8", "dark": "8", "dk": "8", "어두운": "8", "d-3": "8",
			9: "9", "9": "9", "l-4": "9", "----": "9", "grayish": "9", "g": "9", "회색": "9", "잿빛": "9", "d-4": "9",
			10: "10", "10": "10", "l-5": "10", "-----": "10", "dark_grayish": "10", "dkg": "10", "어두운회색": "10", "d-5": "10",
			}

		self.vars["list_엑셀46개_rgb값"] = self.vars["list_46rgb_forexcel"] = [[255, 0, 0], [0, 255, 0], [0, 0, 255], [255, 255, 0], [255, 0, 255],
					 [0, 255, 255], [153, 51, 102], [255, 255, 204], [204, 255, 255], [102, 0, 102],
					 [255, 128, 128], [0, 102, 204], [204, 204, 255], [0, 204, 255], [204, 255, 204],
					 [255, 255, 153], [153, 204, 255], [255, 153, 204], [204, 153, 255], [255, 204, 153],
					 [51, 102, 255], [51, 204, 204], [153, 204, 0], [255, 204, 0], [255, 153, 0],
					 [255, 102, 0], [102, 102, 153], [150, 150, 150], [0, 51, 102], [51, 153, 102],
					 [0, 51, 0], [51, 51, 0], [153, 51, 0], [51, 51, 153], [51, 51, 51],
					 [128, 0, 0], [0, 128, 0], [0, 0, 128], [128, 128, 0], [128, 0, 128],
					 [0, 128, 128], [192, 192, 192], [128, 128, 128], [153, 153, 255], [0, 0, 0],
					 [255, 255, 255]]

		self.vars["dic_엑셀_56가지_색번호_vs_rgb값"] = self.vars["list_56rgb_forexcel"] =  {
			1: [0, 0, 0], 2: [255, 255, 255], 3: [255, 0, 0], 4: [0, 255, 0], 5: [0, 0, 255],
			6: [255, 255, 0], 7: [255, 0, 255], 8: [0, 255, 255], 9: [128, 0, 0], 10: [0, 128, 0],
			11: [0, 0, 128], 12: [128, 128, 0], 13: [128, 0, 128], 14: [0, 128, 128], 15: [192, 192, 192],
			16: [128, 128, 128], 17: [153, 153, 255], 18: [153, 51, 102], 19: [255, 255, 204], 20: [204, 255, 255],
			21: [102, 0, 102], 22: [255, 128, 128], 23: [0, 102, 204], 24: [204, 204, 255], 25: [0, 0, 128],
			26: [255, 0, 255], 27: [255, 255, 0], 28: [0, 255, 255], 29: [128, 0, 128], 30: [128, 0, 0],
			31: [0, 128, 128], 32: [0, 0, 255], 33: [0, 204, 255], 34: [204, 255, 255], 35: [204, 255, 204],
			36: [255, 255, 153], 37: [153, 204, 255], 38: [255, 153, 204], 39: [204, 153, 255], 40: [255, 204, 153],
			41: [51, 102, 255], 42: [51, 204, 204], 43: [153, 204, 0], 44: [255, 204, 0], 45: [255, 153, 0],
			46: [255, 102, 0], 47: [102, 102, 153], 48: [150, 150, 150], 49: [0, 51, 102], 50: [51, 153, 102],
			51: [0, 51, 0], 52: [51, 51, 0], 53: [153, 51, 0], 54: [153, 51, 102], 55: [51, 51, 153],
			56: [51, 51, 51], }

		self.vars["dic_엑셀_색번호_vs_색이름"] = self.vars["excel_colorindex_vs_color_name"] = {
			1: "검정색", 	2: "흰색", 3: "빨강색", 5: "파랑색", 6: "노랑색",
			7: "핑크색", 46: "오렌지", 13: "보라색", 14: "청록색", 19: "옅은노랑",
			20: "옅은하늘", 18: "매실색", 8: "밝은하늘", 4: "연두색", 15: "회색20",
			48: "회색40", 16: "회색60", 56: "회색80", 9: "진한적색", 10: "진한녹색",
			11: "진한청색", 12: "진한황색", 21: "진한보라", 33: "진한하늘", 49: "진한산호색",
			17: "담자색", 45: "토황색", 35: "취람색", 36: "송화색", 40: "두록색",
			22: "주색", 23: "청현색", 24: "회보라색", 37: "밝은벽청색", 38: "선홍색", 47: "치색",
		}

		self.vars["dic_색이름_vs_엑셀_색번호"] = self.vars["excel_colorname_vs_colorindex"] = {
			"bla": 1, "whi": 2, "blu": 5, "yel": 6,
			"pin": 7, "ora": 46, "pur": 13, "gre": 14, "gra": 15,
			"검정색": 1, "흰색": 2, "빨강색": 3, "파랑색": 5, "노랑색": 6,
			"핑크색": 7, "오렌지": 46, "보라색": 13, "청록색": 14, "옅은노랑": 19,
			"옅은하늘": 20, "매실색": 18, "밝은하늘": 8, "연두색": 4, "회색20": 15,
			"회색40": 48, "회색60": 16, "회색80": 56, "진한적색": 9, "진한녹색": 10,
			"진한청색": 11, "진한황색": 12, "진한보라": 21, "진한하늘": 33, "진한산호색": 49,
			"담자색": 17, "토황색": 45, "취람색": 35, "송화색": 36, "두록색": 40,
			"주색": 22, "청현색": 23, "회보라색": 24, "밝은벽청색": 37, "선홍색": 38, "치색": 47,
			"black": 1, "white": 2, "red": 3, "blue": 5, "yellow": 6,
			"pink": 7, "orange": 46, "purple": 13, "green": 14, "gray": 15,
			1: "bla", 2: "whi", 5: "blu", 6: "yel",
			7: "pin", 46: "ora", 13: "pur", 14: "gre", 15: "gra",
		}

		self.vars["dic_색스타일_vs_기본_색스타일"] = self.vars["dic_check_colorstyle"] = {"v": "v", "b": "b", "s": "s", "dp": "dp", "lt": "lt", "sf": "sf", "d": "d", "dk": "dk", "p": "p", "ltg": "ltg", "g": "g", "dkg": "dkg",
				"vivid": "v", "bright": "b", "strong": "s", "deep": "dp", "light": "lt", "soft": "sf", "dull": "d", "dark": "dk", "pale": "p", "lightgrayish": "ltg", "grayish": "g", "darkgrayish": "dkg",
				"viv": "v", "bri": "b", "str": "s", "dee": "dp", "lig": "lt", "sof": "sf", "dul": "d", "dar": "dk", "pal": "p", "gra+": "ltg", "gra": "g", "gra-": "dkg",
				"선명한": "v", "밝은": "b", "강한": "s", "짙은": "dp", "옅은": "lt", "부드러운": "sf", "둔한": "d", "어두운": "dk", "연한": "p", "밝은회색조": "ltg", "회색조": "g", "어두운회색조": "dkg"} 		#기본 색스타일을 기본스타일로 변경하는 것이다

		self.vars["dic_색이름_vs_기본_영어_색이름"] = self.vars["dic_check_colorname"] = {
			"빨": "red", "적": "red", "red": "red", "r": "red", "빨강": "red", 0: "red",
			"주": "ora", "yr": "ora", "yellowred": "ora", "o": "ora", "orange": "ora", "ora": "ora", "주황": "ora", 1: "ora", 30: "ora",
			"노": "yel", "y": "yel", "yellow": "yel", "yel": "yel", "노랑": "yel", 2: "yel", 60: "yel",
			"연": "gre_yel", "gre_yel": "gre_yel", "greenyellow": "gre_yel", "연두": "gre_yel", "green-yellow": "gre_yel", "yg": "gre_yel", 3: "gre_yel", 90: "gre_yel",
			"초": "gre", "g": "gre", "green": "gre", "gre": "gre", "녹색": "gre", "초록": "gre", 4: "gre", 120: "gre",
			"연초록": "gre_cya", "green-cyan": "gre_cya", "cg": "gre_cya", "gc": "gre_cya", 5: "gre_cya", 150: "gre_cya",
			"옥": "cya", "옥색": "cya", "c": "cya", "cya": "cya", "cyan": "cya", 6: "cya", 180: "cya",
			"청록": "blu_cya", "blue-cyan": "blu_cya", "청": "blu_cya", "cb": "blu_cya", "bg": "blu_cya", "bluegreen": "blu_cya", "blu_cya": "blu_cya", 7: "blu_cya", 210: "blu_cya",
			"파": "blu", "b": "blu", "blue": "blu", "blu": "blu", "파랑": "blu", 8: "blu", 240: "blu",
			"남": "blu_mag", "blue-magenta": "blu_mag", "blue_magenta": "blu_mag", "mb": "blu_mag", "blu_mag": "blu_mag", "pb": "blu_mag", "purpleblue": "blu_mag", "violet": "blu_mag", "vio": "blu_mag", "남색": "blu_mag", 9: "blu_mag", 270: "blu_mag",
			"보": "mag", "magenta": "mag", "m": "mag", "보라": "mag", "mag": "mag", 10: "mag", 300: "mag",
			"자홍": "red_mag", "red-magenta": "red_mag", "red_mag": "red_mag", "red_magenta": "red_mag", "mr": "red_mag", "자주": "red_mag", 11: "red_mag", 330: "red_mag",
			"회": "gra", "회색": "gra", "gra": "gra", "gray": "gra", 12: "gra",
			"흰": "whi", "하양": "whi", "white": "whi", "whi": "whi", "흰색": "whi", 13: "whi",
			"검": "bla", "검정": "bla", "black": "bla", "흑": "bla", "bla": "bla", 14: "bla",
			} #자주 사용하는 색의 이름을 기본색 이름으로 변경하는 것이다

		self.vars["dic_색강도_vs_기본값"] = self.vars["dic_colorname_colornum_forexcel"] = {
			55: "55", "55": "55", "ls": "55", "strong": "55", "s": "55", "강한": "55", "기준": "55",
			0: "0", "0": "0", "l5": "0", "+++++": "0", "pale": "0", "p": "0", "pastel": "0", "파스텔": "0", "d5": "0",
			1: "1", "1": "1", "l4": "1", "++++": "1", "light grayish": "1", "ltg": "1", "d4": "1",
			2: "2", "2": "2", "l3": "2", "+++": "2", "light": "2", "lt": "2", "흐린": "2", "가벼운": "2", "d3": "2",
			3: "3", "3": "3", "l2": "3", "++": "3", "soft": "3", "sf": "3", "연한": "3", "d2": "3",
			4: "4", "4": "4", "l1": "4", "+": "4", "bright": "4", "b": "4", "밝은": "4", "d1": "4",
			5: "5", "5": "5", "l0": "5", "": "5", "vivid": "5", "v": "5", "선명한": "5", "basic": "5", "기본": "5", "d0": "5",
			6: "6", "6": "6", "l-1": "6", "-": "6", "deep": "6", "dp": "6", "진한": "6", "d-1": "6",
			7: "7", "7": "7", "l-2": "7", "--": "7", "dull": "7", "d": "7", "탁한": "7", "d-2": "7",
			8: "8", "8": "8", "l-3": "8", "---": "8", "dark": "8", "dk": "8", "어두운": "8", "d-3": "8",
			9: "9", "9": "9", "l-4": "9", "----": "9", "grayish": "9", "g": "9", "회색빛": "9", "잿빛": "9", "d-4": "9",
			10: "10", "10": "10", "l-5": "10", "-----": "10", "dark grayish": "10", "dkg": "10", "어두운 회색": "10", "d-5": "10",
			} #컬러의 강도를 확인하는것

		self.vars["dic_색이름_한글_vs_엑셀_색번호"] = {
			"검정색": 1, 	"흰색": 2, "빨강색": 3, "파랑색": 5, "노랑색": 6,
			"핑크색": 7, "오렌지": 46, "보라색": 13, "청록색": 14, "옅은노랑": 19,
			"옅은하늘": 20, "매실색": 18, "밝은하늘": 8, "연두색": 4, "회색20": 15,
			"회색40": 48, "회색60": 16, "회색80": 56, "진한적색": 9, "진한녹색": 10,
			"진한청색": 11, "진한황색": 12, "진한보라": 21, "진한하늘": 33, "진한산호색": 49,
			"담자색": 17, "토황색": 45, "취람색": 35, "송화색": 36, "두록색": 40,
			"주색": 22, "청현색": 23, "회보라색": 24, "밝은벽청색": 37, "선홍색": 38, "치색": 47,
			"black": 1, "white": 2, "red": 3, "blue": 5, "yellow": 6,
			"pink": 7, "orange": 46, "purple": 13, "green": 14, "gray": 15,
			"bla": 1, "whi": 2, "blu": 5, "yel": 6,
			"pin": 7, "ora": 46, "pur": 13, "gre": 14, "gra": 15,
			"검정": 1, 	"빨강": 3, "파랑": 5, "노랑": 6,
			"핑크": 7, "보라": 13, "청록": 14, "회색": 15,
		}

		self.vars["dic_엑셀_색번호_vs_rgb값"] = self.vars["dic_colorindex_rgblist"] = {
			1: [0, 0, 0], 2: [255, 255, 255], 3: [255, 0, 0], 4: [0, 255, 0], 5: [0, 0, 255],
			6: [255, 255, 0], 7: [255, 0, 255], 8: [0, 255, 255], 9: [128, 0, 0], 10: [0, 128, 0],
			11: [0, 0, 128], 12: [128, 128, 0], 13: [128, 0, 128], 14: [0, 128, 128], 15: [192, 192, 192],
			16: [128, 128, 128], 17: [153, 153, 255], 18: [153, 51, 102], 19: [255, 255, 204], 20: [204, 255, 255],
			21: [102, 0, 102], 22: [255, 128, 128], 23: [0, 102, 204], 24: [204, 204, 255], 25: [0, 0, 128],
			26: [255, 0, 255], 27: [255, 255, 0], 28: [0, 255, 255], 29: [128, 0, 128], 30: [128, 0, 0],
			31: [0, 128, 128], 32: [0, 0, 255], 33: [0, 204, 255], 34: [204, 255, 255], 35: [204, 255, 204],
			36: [255, 255, 153], 37: [153, 204, 255], 38: [255, 153, 204], 39: [204, 153, 255], 40: [255, 204, 153],
			41: [51, 102, 255], 42: [51, 204, 204], 43: [153, 204, 0], 44: [255, 204, 0], 45: [255, 153, 0],
			46: [255, 102, 0], 47: [102, 102, 153], 48: [150, 150, 150], 49: [0, 51, 102], 50: [51, 153, 102],
			51: [0, 51, 0], 52: [51, 51, 0], 53: [153, 51, 0], 54: [153, 51, 102], 55: [51, 51, 153],
			56: [51, 51, 51], }

		self.vars["list_colormode_kor"]= self.vars["list_colormode_kor"]= ["단색조합", "등간격 3색 조화", "보색", "인접색", "근접보색조합",
							   "고명도배색", "고명도배색+약간더 부드러운 이미지",
							   "중명도배색", "중명도배색+약간더 부드러운 이미지", "저중명도배색", "저명도배색+약간더 어두운 이미지",
							   "명도차가 큰 배색", "명도차가 큰 배색 + 근접보색",
							   "고채도 배색", "채도차가 큰 배색", "저채도 배색", ]

		self.vars["list_엑셀_56가지_rgb값"] =self.vars["rgb_56_for_excel"] = [[0, 0, 0], [255, 255, 255], [255, 0, 0], [0, 255, 0], [0, 0, 255], [255, 255, 0],
										[255, 0, 255], [0, 255, 255], [128, 0, 0], [0, 128, 0], [0, 0, 128], [128, 128, 0],
										[128, 0, 128], [0, 128, 128], [192, 192, 192], [128, 128, 128], [153, 153, 255],
										[153, 51, 102], [255, 255, 204], [204, 255, 255], [102, 0, 102], [255, 128, 128],
										[0, 102, 204], [204, 204, 255], [0, 0, 128], [255, 0, 255], [255, 255, 0],
										[0, 255, 255], [128, 0, 128], [128, 0, 0], [0, 128, 128], [0, 0, 255],
										[0, 204, 255], [204, 255, 255], [204, 255, 204], [255, 255, 153], [153, 204, 255],
										[255, 153, 204], [204, 153, 255], [255, 204, 153], [51, 102, 255], [51, 204, 204],
										[153, 204, 0], [255, 204, 0], [255, 153, 0], [255, 102, 0], [102, 102, 153],
										[150, 150, 150], [0, 51, 102], [51, 153, 102], [0, 51, 0], [51, 51, 0],
										[153, 51, 0], [153, 51, 102], [51, 51, 153], [51, 51, 51]]

		self.vars["list_johannes의_hsl값"] = self.vars["hsl_no_for_johannes_style"] = [
			[[0, 100, 0], [0, 100, 10], [0, 100, 20], [0, 100, 30], [0, 100, 40], [0, 100, 50], [0, 100, 60], [0, 100, 70],
			 [0, 100, 80], [0, 100, 90], [0, 100, 100]],
			[[30, 100, 0], [30, 100, 10], [30, 100, 20], [30, 100, 30], [30, 100, 40], [30, 100, 50], [30, 100, 60],
			 [30, 100, 70], [30, 100, 80], [30, 100, 90], [30, 100, 100]],
			[[60, 100, 0], [60, 100, 10], [60, 100, 20], [60, 100, 30], [60, 100, 40], [60, 100, 50], [60, 100, 60],
			 [60, 100, 70], [60, 100, 80], [60, 100, 90], [60, 100, 100]],
			[[90, 100, 0], [90, 100, 10], [90, 100, 20], [90, 100, 30], [90, 100, 40], [90, 100, 50], [90, 100, 60],
			 [90, 100, 70], [90, 100, 80], [90, 100, 90], [90, 100, 100]],
			[[120, 100, 0], [120, 100, 10], [120, 100, 20], [120, 100, 30], [120, 100, 40], [120, 100, 50], [120, 100, 60],
			 [120, 100, 70], [120, 100, 80], [120, 100, 90], [120, 100, 100]],
			[[150, 100, 0], [150, 100, 10], [150, 100, 20], [150, 100, 30], [150, 100, 40], [150, 100, 50], [150, 100, 60],
			 [150, 100, 70], [150, 100, 80], [150, 100, 90], [150, 100, 100]],
			[[180, 100, 0], [180, 100, 10], [180, 100, 20], [180, 100, 30], [180, 100, 40], [180, 100, 50], [180, 100, 60],
			 [180, 100, 70], [180, 100, 80], [180, 100, 90], [180, 100, 100]],
			[[210, 100, 0], [210, 100, 10], [210, 100, 20], [210, 100, 30], [210, 100, 40], [210, 100, 50], [210, 100, 60],
			 [210, 100, 70], [210, 100, 80], [210, 100, 90], [210, 100, 100]],
			[[240, 100, 0], [240, 100, 10], [240, 100, 20], [240, 100, 30], [240, 100, 40], [240, 100, 50], [240, 100, 60],
			 [240, 100, 70], [240, 100, 80], [240, 100, 90], [240, 100, 100]],
			[[270, 100, 0], [270, 100, 10], [270, 100, 20], [270, 100, 30], [270, 100, 40], [270, 100, 50], [270, 100, 60],
			 [270, 100, 70], [270, 100, 80], [270, 100, 90], [270, 100, 100]],
			[[300, 100, 0], [300, 100, 10], [300, 100, 20], [300, 100, 30], [300, 100, 40], [300, 100, 50], [300, 100, 60],
			 [300, 100, 70], [300, 100, 80], [300, 100, 90], [300, 100, 100]],
			[[330, 100, 0], [330, 100, 10], [330, 100, 20], [330, 100, 30], [330, 100, 40], [330, 100, 50], [330, 100, 60],
			 [330, 100, 70], [330, 100, 80], [330, 100, 90], [330, 100, 100]]]

		self.vars["list_faber의_sl값"] = self.vars["list_faber_sl"] = [[[100, 0], [100, 50], [0, 0]],
					[[0, 0], [0, 75], [0, 100]],
					[[100, 0], [25, 75], [0, 100]],
					[[25, 0], [10, 50], [0, 75]],
					[[100, 0], [0, 0], [0, 100]],
					[[25, 0], [10, 50], [0, 75], [25, 75]], ]

		self.vars["dic_엑셀_색번호_vs_색이름_한글"] = self.vars["dic_colornum_colorname_forexcel"] = {
			1: "검정색", 	2: "흰색", 3: "빨강색", 5: "파랑색", 6: "노랑색",
			7: "핑크색", 46: "오렌지", 13: "보라색", 14: "청록색", 19: "옅은노랑",
			20: "옅은하늘", 18: "매실색", 8: "밝은하늘", 4: "연두색", 15: "회색20",
			48: "회색40", 16: "회색60", 56: "회색80", 9: "진한적색", 10: "진한녹색",
			11: "진한청색", 12: "진한황색", 21: "진한보라", 33: "진한하늘", 49: "진한산호색",
			17: "담자색", 45: "토황색", 35: "취람색", 36: "송화색", 40: "두록색",
			22: "주색", 23: "청현색", 24: "회보라색", 37: "밝은벽청색", 38: "선홍색", 47: "치색",
		}

		self.vars["dic_번호_vs_색변환모드"] = self.vars["dic_check_colormode"] = {1: "단색조합", "단색조합": 1, "강력한 대기효과와 넓은공간감": 1,
							  2: "등간격 3색 조화", "등간격 3색 조화": 2, "활동적인 인상과 이미지": 2,
							  3: "보색", "보색": 3, "강력한비교": 3,
							  4: "인접색", "인접색": 4, "비슷한색 찾기": 4,
							  5: "근접보색조합", "근접보색조합": 5, "보색의 강한 인상이 부담스러울때 보색의 근처에있는 색": 5,
							  6: "고명도배색", "고명도배색": 6,
							  7: "고명도배색+약간더 부드러운 이미지", "고명도배색+약간더 부드러운 이미지": 7,
							  8: "중명도배색", "중명도배색": 8,
							  9: "중명도배색+약간더 부드러운 이미지", "중명도배색+약간더 부드러운 이미지": 9,
							  10: "저중명도배색", "저중명도배색": 10,
							  11: "저명도배색+약간더 어두운 이미지", "저명도배색+약간더 어두운 이미지": 11,
							  12: "명도차가 큰 배색", "명도차가 큰 배색": 12,
							  13: "명도차가 큰 배색 + 근접보색", "명도차가 큰 배색 + 근접보색": 13,
							  14: "고채도 배색", "고채도 배색": 14,
							  15: "채도차가 큰 배색", "채도차가 큰 배색": 15,
							  16: "저채도 배색", "저채도 배색": 16, "차분하고 무거운 이미지": 16,
							  }

		self.vars["dic_선모양_vs_index번호"] = self.vars["enum_line"] = {
			"msoArrowheadNone": 1, "msoArrowheadTriangle": 2, "msoArrowheadOpen": 3, "msoArrowheadStealth": 4,
			"msoArrowheadDiamond": 5, "msoArrowheadOval": 6,
			"": 1, "<": 2, ">o": 3, ">>": 4, ">": 2, "<>": 5, "o": 6,
			"basic": 1, "none": 1, "triangle": 2, "open": 3, "stealth": 4, "diamond": 5, "oval": 6,
			"msoArrowheadNarrow": 1, "msoArrowheadWidthMedium": 2, "msoArrowheadWide": 3,
			"msoArrowheadShort": 1, "msoArrowheadLengthMedium": 2, "msoArrowheadLong": 3,
			"short": 1, "narrow": 1, "medium": 2, "long": 3, "wide": 3,
			"-1": 1, "0": 2, "1": 3,
			"dash": 4, "dashdot": 5, "dashdotdot": 6, "rounddot": 3, "longdash": 7, "longdashdot": 8,
			"longdashdotdot": 9,
			"squaredot": 2,
			"-": 4, "-.": 5, "-..": 6, ".": 3, "--": 7, "--.": 8, "--..": 9, "ㅁ": 2,
		}

		self.vars["dic_선위치_vs_index번호"] = self.vars["excel_line_position"] = {
		                                    "l": [7], "left": [7], "왼쪽": [7],
		                                    "t": [8], "top": [8], "위쪽": [8],
		                                    "b": [9], "bottom": [9], "아래쪽": [9],
		                                    "r": [10], "right": [10], "오른쪽": [10],
		                                    "h": [11], "inside-h": [11], "inh": [11], "안쪽세로": [11], "|": [11],
		                                    "v": [12], "inside-v": [12], "inv": [12], "안쪽가로": [12], "-": [12],
		                                    "a": [7, 8, 9, 10, 11, 12], "all": [7, 8, 9, 10, 11, 12],
		                                    "전부": [7, 8, 9, 10, 11, 12],
		                                    "o": [7, 8, 9, 10], "테두리": [7, 8, 9, 10], "": [7, 8, 9, 10],
		                                    "basic": [7, 8, 9, 10],
		                                    "out": [7, 8, 9, 10],
		                                    "/": [6], "대각선오른쪽": [6],
		                                    "\\": [5], "대각선왼쪽": [5],
		                                    "in": [11, 12],
		                                    "total": [5, 6, 7, 8, 9, 10, 11, 12],
		                 }

		self.vars["dic_base_cell_data"] = {
			"sheet_name": "",
			"xyxy": [100, 100, 0, 0],
			"color": 10058239,
			"line_style": "-.",
			"thickness": 0.5,
			"transparency": 0,
			"head_style": ">",
			"head_length": "0",
			"head_width": "0",
			"tail_style": ">",
			"tail_length": "0",
			"tail_width": "0",
		}

		self.vars["dic_jamo_vs_eng"] = {
			"ㄱ" : "a", "ㄲ" : "aa", "ㄴ" : "b", "ㄷ" : "c", "ㄸ" : "cc",
			"ㄹ" : "d", "ㅁ" : "e", "ㅂ" : "f", "ㅃ" : "ff",
			"ㅅ" : "g", "ㅆ" : "gg", "ㅇ" : "h", "ㅈ" : "i",
			"ㅉ" : "ii", "ㅊ" : "j", "ㅋ" : "k", "ㅌ" : "l", "ㅍ" : "m", "ㅎ":"n",

			"ㄳ" : "ag", "ㄵ" : "bi", "ㄶ" : "bn", "ㄺ" : "da",
			"ㄻ" : "de", "ㄼ" : "df", "ㄽ" : "dg", "ㄾ" : "dl",
			"ㄿ" : "dm", "ㅀ" : "dn", "ㅄ" : "fg",


			"ㅏ" : "o", "ㅐ" : "ox", "ㅑ" : "p", "ㅒ" : "px", "ㅓ" : "q",
			"ㅔ" : "gx", "ㅕ" : "r", "ㅖ" : "rx", "ㅗ" : "s", "ㅘ" : "so",
			"ㅙ" : "sox", "ㅚ" : "sx", "ㅛ" : "t", "ㅜ" : "u", "ㅝ" : "ug",
			"ㅞ" : "ugx", "ㅟ" : "ux", "ㅠ" : "v", "ㅡ" : "w", "ㅢ" : "wx", "ㅣ":"x",

			"" : "", "_" : "z",
			}

		self.vars["list_eng_vs_jamo"] = {
			'a': 'ㄱ', 'aa': 'ㄲ', 'b': 'ㄴ', 'c': 'ㄷ', 'cc': 'ㄸ', 'd': 'ㄹ',
			'e': 'ㅁ', 'f': 'ㅂ', 'ff': 'ㅃ', 'g': 'ㅅ', 'gg': 'ㅆ', 'h': 'ㅇ',
			'i': 'ㅈ', 'ii': 'ㅉ', 'j': 'ㅊ', 'k': 'ㅋ', 'l': 'ㅌ', 'm': 'ㅍ',
			'n': 'ㅎ', 'ag': 'ㄳ', 'bi': 'ㄵ', 'bn': 'ㄶ', 'da': 'ㄺ', 'de': 'ㄻ',
			'df': 'ㄼ', 'dg': 'ㄽ', 'dl': 'ㄾ', 'dm': 'ㄿ', 'dn': 'ㅀ', 'fg': 'ㅄ',
			'o': 'ㅏ', 'ox': 'ㅐ', 'p': 'ㅑ', 'px': 'ㅒ', 'q': 'ㅓ', 'gx': 'ㅔ',
			'r': 'ㅕ', 'rx': 'ㅖ', 's': 'ㅗ', 'so': 'ㅘ', 'sox': 'ㅙ', 'sx': 'ㅚ',
			't': 'ㅛ', 'u': 'ㅜ', 'ug': 'ㅝ', 'ugx': 'ㅞ', 'ux': 'ㅟ', 'v': 'ㅠ',
			'w': 'ㅡ', 'wx': 'ㅢ', 'x': 'ㅣ', '': '', 'z': '_'}

		self.vars["list_eng_vs_jamo_pair"] = [
			[['sox', 'ㅙ'], ['ugx', 'ㅞ'],],
			[['ox', 'ㅐ'], ['px', 'ㅒ'], ['gx', 'ㅔ'], ['rx', 'ㅖ'], ['so', 'ㅘ'], ['sx', 'ㅚ'], ['wx', 'ㅢ'], ['ug', 'ㅝ'], ['ux', 'ㅟ'],],
			[['a', 'ㄱ'],['b', 'ㄴ'],['c', 'ㄷ'], ['d', 'ㄹ'], ['e', 'ㅁ'], ['f', 'ㅂ'], ['g', 'ㅅ'], ['h', 'ㅇ'], ['i', 'ㅈ'], ['j', 'ㅊ'], ['k', 'ㅋ'], ['l', 'ㅌ'], ['m', 'ㅍ'], ['n', 'ㅎ']],
			[['aa', 'ㄲ'], ['cc', 'ㄸ'],['ff', 'ㅃ'], ['gg', 'ㅆ'], ['ii', 'ㅉ'], ['ag', 'ㄳ'], ['bi', 'ㄵ'], ['bn', 'ㄶ'], ['da', 'ㄺ'], ['de', 'ㄻ'], ['df', 'ㄼ'], ['dg', 'ㄽ'], ['dl', 'ㄾ'], ['dm', 'ㄿ'], ['dn', 'ㅀ'], ['fg', 'ㅄ'],],
			[['o', 'ㅏ'], ['p', 'ㅑ'], ['q', 'ㅓ'], ['r', 'ㅕ'], ['s', 'ㅗ'], ['t', 'ㅛ'], ['u', 'ㅜ'], ['v', 'ㅠ'], ['w', 'ㅡ'], ['x', 'ㅣ'],],
		    [['z', '_']],
			]

		self.vars["dic_jfinder_gui_dic_1"] = {"탐색방법 => 최소탐색": [1, '(최소찾기)'], "탐색방법 => 최대탐색": [1, "(최대찾기)"],
		              "컴파일 방법 => 대소문자무시": [1, "(대소문자무시)"],
		              "컴파일 방법 => 개행문자포함": [1, "(개행문자포함)"],
		              "컴파일 방법 => 여러줄로표현": [1, "(여러줄로표현)"],
		              }

		self.vars["dic_jfinder_gui_dic_2"] = {
			"문장 맨처음부터 맞아야함": [2, '[처음]', "type_20"],
			"맨끝에 맞아야함": [2, '[맨끝]', "type_20"],
			"한글": [2, '한글&', "type_21"],
			"한글모음": [2, '한글모음&', "type_21"],
			"한글자음": [2, '한글자음&', "type_21"],
			"영어": [2, "영어&", "type_21"],
			"한자": [2, "한자&", "type_21"],
			"일어": [2, "일본어&", "type_21"],
			"공백(공백, 탭 등)": [2, "공백&", "type_21"],
			"숫자": [2, "숫자&", "type_21"],
			"제외, not(포함하지 않음)": [2, "^", "type_22"],
			"문자1개": [2, "[문자]", "type_23"],
			"연속된 2~5까지의 숫자": [2, "[2-5", "type_24"],
			"연속된 c~e까지의 문자": [2, "[c-e", "type_24"],
			"j 또는 f 또는 i가 들어간 문자": [2, "[jfi", "type_24"],
			"abc가 단어가 들어간 문자": [2, "[(abc)", "type_24"],
			"특정단어": [2, "[(특정단어)", "type_24"],
			"메타문자": [2, "[\메타문자", "type_24"],
			"특수문자": [2, '[특수문자', "type_24"],
			"특정단어제외": [2, '[^(제외할단어)', "type_24"],
			"또는": [2, '|', "type_25"],
			}

		self.vars["dic_jfinder_gui_dic_3"] = {"1개": [3, ":1~1]", "type_x0"],
		              "1개이상": [3, ":1~]", "type_x0"],
		              "1~10개사이": [3, ":1~10]", "type_x0"],
		              "0개이상": [3, ":0~]", "type_x0"],
		              "0개또는1개": [3, ":0~1]", "type_x0"],
		              "n개~m개": [3, ":n~m]", "type_x0"],
		              }

		self.vars["dic_jfinder_gui_dic_4"] = {"abc중 c만 1번이상 반복되는것 찾기": [4, "abc[1~]", "type_z0"],
		              "abc중 bc만 1번이상 반복되는것 찾기": [4, "a(bc)[1~]", "type_z0"],
		              "a와 b와 c를 제외한 모든 문자와 매치": [4, "[^abc]", "type_z0"],
		              "한글로 3~5개의 글자로 된것을 그룹명 짖기": [4, "(?P<그룹명>[한글:3~5])", "type_z0"],
		              "a와 b사이의 모든문자 찾기": [4, "a[문자:1~]b", "type_z0"],
		              "a또는b또는c": [4, "a[또는]b[또는]c", "type_z0"],
		              "전방탐색 : .+(?=:) => :앞의 모든 문자": [4, ".+(?=:)", "type_z0"],
		              "후방탐색 : (?<=\$)[0-9.]+ => $뒤의 숫자": [4, "(?<=\$)[0-9.]+", "type_z0"],
		              "Html태그중 <H숫자>찾을문자<\H숫자>안의 글자": [4, "<H(0-30])>.*?</H\\1>", "type_z0"],
		              "문장중 핸드폰번호 찾기": [4, "0[1~1][숫자:2~2]-[0~1][숫자:3~4]-[0~1][숫자:4~4]", "type_z0"],
		              "2022-01-01형식의 날짜찾기": [4, "[0-9]{4})-([0-9]{2})-([0-9]{2}", "type_z0"],
		              "이메일찾기": [4, "[\w\.-]+@[\w\.-]+", "type_z0"],
		              "괄호안의 숫자 찾기": [4, "([모든문자:0~])", "type_z0"],
		              "지역 전화번호 찾기": [4, "0(2|31|32|33|41|42|43|44|51|52|53|54|55|61|62|63|64)\-{0,1}\d{3,4}\-{0,1}\d{4}",
		                             "type_z0"],
		              "주민등록번호": [4, "[0-9]{2}0[1-9]|1[0-2]0[1-9]|[1,2][0-9]|3[0,1]-[1-4][0-9]{6}", "type_z0"],
		              "금액": [4, "[숫자,][1~][원:0~1]", "type_z0"],
		              "중복된 단어 찾기": [4, "\\b(\\w+)\\s+\\1\\b", "type_z0"],
		              }

		self.vars["dic_shape_enum"] ={
			'mixed': -2,			'rectangle': 1,			'직사각형': 1,
			'parallelogram': 2,			'평행사변형': 2,			'trapezoid': 3,
			'사다리꼴': 3,			'diamond': 4,			'다이아몬드': 4,
			'roundedrectangle': 5,			'둥근모서리사각형': 5,			'Octagon': 6,
			'팔각형': 6,			'isoscelestriangle': 7,			'이등변삼각형': 7,
			'RightTriangle': 8,			'직각삼각형': 8,			'Oval': 9,
			'타원': 9,			'Hexagon': 10,			'육각형': 10,
			'Cross': 11,			'십자형': 11,			'RegularPentagon': 12,
			'오각형': 12,			'Can': 13,			'원통형': 13,
			'Cube': 14,			'정육면체': 14,			'Bevel': 15,
			'빗면사각형': 15,			'FoldedCorner': 16,			'모서리접힌사각형': 16,			'SmileyFace': 17,
			'웃는얼굴': 17,			'Donut': 18,			'원형': 18,
			'NoSymbol': 19,			'BlockArc': 20,			'막힌원호': 20,			'Heart': 21,			'하트': 21,
			'LightningBolt': 22,			'번개': 22,
			'Sun': 23,			'해': 23,			'Moon': 24,			'달': 24,			'Arc': 25,			'원호': 25,			'DoubleBracket': 26,
			'양쪽대괄호': 26,			'DoubleBrace': 27,			'양쪽중괄호': 27,			'Plaque': 28,
			'배지': 28,		'LeftBracket': 29,			'왼쪽대괄호': 29,			'RightBracket': 30,
			'오른쪽대괄호': 30,			'LeftBrace': 31,			'왼쪽중괄호': 31,			'RightBrace': 32,
			'오른쪽중괄호': 32,			'RightArrow': 33,			'오른쪽화살표': 33,			'LeftArrow': 34,
			'왼쪽화살표': 34,			'UpArrow': 35,			'위쪽화살표': 35,			'DownArrow': 36,
			'아래쪽화살표': 36,			'LeftRightArrow': 37,			'왼쪽오른쪽화살표': 37,			'UpDownArrow': 38,
			'위쪽아래쪽화살표': 38,			'QuadArrow': 39,			'상하좌우화살표': 39,			'LeftRightUpArrow': 40,
			'상좌우화살표': 40,			'BentArrow': 41,			'굽음화살표': 41,			'UTurnArrow': 42,
			'U턴화살표': 42,			'LeftUpArrow': 43,			'좌상화살표': 43,			'BentUpArrow': 44,
			'위로굽음화살표': 44,			'CurvedRightArrow': 45,			'CurvedLeftArrow': 46,			'CurvedUpArrow': 47,
			'CurvedDownArrow': 48,			'StripedRightArrow': 49,			'NotchedRightArrow': 50,			'Pentagon': 51,
			'Chevron': 52,			'RightArrowCallout': 53,			'LeftArrowCallout': 54,			'UpArrowCallout': 55,
			'DownArrowCallout': 56,			'LeftRightArrowCallout': 57,			'UpDownArrowCallout': 58,			'QuadArrowCallout': 59,
			'CircularArrow': 60,			'FlowchartProcess': 61,			'FlowchartAlternateProcess': 62,			'FlowchartDecision': 63,
			'FlowchartData': 64,			'FlowchartPredefinedProcess': 65,			'FlowchartInternalStorage': 66,			'FlowchartDocument': 67,
			'FlowchartMultidocument': 68,			'FlowchartTerminator': 69,			'FlowchartPreparation': 70,			'FlowchartManualInput': 71,
			'FlowchartManualOperation': 72,			'FlowchartConnector': 73,			'FlowchartOffpageConnector': 74,			'FlowchartCard': 75,
			'FlowchartPunchedTape': 76,			'FlowchartSummingJunction': 77,			'FlowchartOr': 78,			'FlowchartCollate': 79,
			'FlowchartSort': 80,			'FlowchartExtract': 81,			'FlowchartMerge': 82,			'FlowchartStoredData': 83,
			'FlowchartDelay': 84,			'FlowchartSequentialAccessStorage': 85,			'FlowchartMagneticDisk': 86,			'FlowchartDirectAccessStorage': 87,
			'FlowchartDisplay': 88,			'Explosion1': 89,			'Explosion2': 90,			'4pointStar': 91,
			'5pointStar': 92,			'8pointStar': 93,			'16pointStar': 94,			'24pointStar': 95,
			'32pointStar': 96,			'UpRibbon': 97,			'DownRibbon': 98,			'CurvedUpRibbon': 99,
			'CurvedDownRibbon': 100,			'VerticalScroll': 101,			'HorizontalScroll': 102,			'Wave': 103,
			'DoubleWave': 104,			'RectangularCallout': 105,			'RoundedRectangularCallout': 106,			'OvalCallout': 107,
			'CloudCallout': 108,			'LineCallout1': 109,			'LineCallout2': 110,			'LineCallout3': 111,
			'LineCallout4': 112,			'LineCallout1AccentBar': 113,			'LineCallout2AccentBar': 114,			'LineCallout3AccentBar': 115,
			'LineCallout4AccentBar': 116,			'LineCallout1NoBorder': 117,			'LineCallout2NoBorder': 118,			'LineCallout3NoBorder': 119,
			'LineCallout4NoBorder': 120,			'LineCallout1BorderandAccentBar': 121,			'LineCallout2BorderandAccentBar': 122,			'LineCallout3BorderandAccentBar': 123,
			'LineCallout4BorderandAccentBar': 124,			'ActionButtonCustom': 125,			'ActionButtonHome': 126,			'ActionButtonHelp': 127,
			'ActionButtonInformation': 128,			'ActionButtonBackorPrevious': 129,			'ActionButtonForwardorNext': 130,			'ActionButtonBeginning': 131,
			'ActionButtonEnd': 132,			'ActionButtonReturn': 133,			'ActionButtonDocument': 134,			'ActionButtonSound': 135,
			'ActionButtonMovie': 136,			'Balloon': 137,			'NotPrimitive': 138,			'FlowchartOfflineStorage': 139,
			'LeftRightRibbon': 140,			'DiagonalStripe': 141,			'Pie': 142,			'NonIsoscelesTrapezoid': 143,
			'Decagon': 144,			'Heptagon': 145,			'Dodecagon': 146,			'6pointStar': 147,
			'7pointStar': 148,			'10pointStar': 149,			'12pointStar': 150,			'Round1Rectangle': 151,
			'Round2SameRectangle': 152,			'SnipRoundRectangle': 154,			'Snip1Rectangle': 155,			'Snip2SameRectangle': 156,
			'Round2DiagRectangle': 157,			'Snip2DiagRectangle': 157,			'Frame': 158,			'HalfFrame': 159,
			'Tear': 160,			'Chord': 161,			'Corner': 162,			'MathPlus': 163,
			'MathMinus': 164,			'MathMultiply': 165,			'MathDivide': 166,			'MathEqual': 167,
			'MathNotEqual': 168,			'CornerTabs': 169,			'SquareTabs': 170,			'PlaqueTabs': 171,
			'Gear6': 172,			'Gear9': 173,			'Funnel': 174,			'PieWedge': 175,
			'LeftCircularArrow': 176,			'LeftRightCircularArrow': 177,			'SwooshArrow': 178,
			'Cloud': 179,			'ChartX': 180,			'ChartStar': 181,			'ChartPlus': 182,			'LineInverse': 183,}

		self.vars["keyboard_action_list_all"] =['\\t', '\\n', '\\r', ' ', '!', '"', '#', '$', '%', '&', "'", '(',
				')', '*', '+', ',', '-', '.', '/', '0', '1', '2', '3', '4', '5', '6', '7',
				'8', '9', ':', ';', '<', '=', '>', '?', '@', '[', '\\', ']', '^', '_', '`',
				'a', 'b', 'c', 'd', 'e','f', 'g', 'h', 'i', 'j', 'k', 'l', 'm', 'n', 'o',
				'p', 'q', 'r', 's', 't', 'u', 'v', 'w', 'x', 'y', 'z', '{', '|', '}', '~',
				'accept', 'add', 'alt', 'altleft', 'altright', 'apps', 'backspace',
				'browserback', 'browserfavorites', 'browserforward', 'browserhome',
				'browserrefresh', 'browsersearch', 'browserstop', 'capslock', 'clear',
				'convert', 'ctrl', 'ctrlleft', 'ctrlright', 'decimal', 'del', 'delete',
				'divide', 'down', 'end', 'enter', 'esc', 'escape', 'execute', 'f1', 'f10',
				'f11', 'f12', 'f13', 'f14', 'f15', 'f16', 'f17', 'f18', 'f19', 'f2', 'f20',
				'f21', 'f22', 'f23', 'f24', 'f3', 'f4', 'f5', 'f6', 'f7', 'f8', 'f9',
				'final', 'fn', 'hanguel', 'hangul', 'hanja', 'help', 'home', 'insert', 'junja',
				'kana', 'kanji', 'launchapp1', 'launchapp2', 'launchmail',
				'launchmediaselect', 'left', 'modechange', 'multiply', 'nexttrack',
				'nonconvert', 'num0', 'num1', 'num2', 'num3', 'num4', 'num5', 'num6',
				'num7', 'num8', 'num9', 'numlock', 'pagedown', 'pageup', 'pause', 'pgdn',
				'pgup', 'playpause', 'prevtrack', 'print', 'printscreen', 'prntscrn',
				'prtsc', 'prtscr', 'return', 'right', 'scrolllock', 'select', 'separator',
				'shift', 'shiftleft', 'shiftright', 'sleep', 'space', 'stop', 'subtract', 'tab',
				'up', 'volumedown', 'volumemute', 'volumeup', 'win', 'winleft', 'winright', 'yen',
				'command', 'option', 'optionleft', 'optionright']

		self.vars["action_key_list"] = [
		'f1', 'f10', 'f11', 'f12', 'f2', 'f3', 'f4', 'f5', 'f6', 'f7', 'f8', 'f9',	'fn',
		'left', 'right','up', 'down','end', 'home','space', 'tab',
		'alt', 'altleft', 'altright', 'ctrl', 'ctrlleft', 'ctrlright','shift', 'shiftleft', 'shiftright', 'win', 'winleft', 'winright',
		'capslock', 'del', 'delete','backspace', 'enter', 'esc', 'escape', 'insert','numlock',
		'pagedown', 'pageup', 'pgdn', 'pgup',
		'hanguel', 'hangul', 'hanja',
		'printscreen', 'prtscr',
		]

		self.vars["keyboard_hex_code"] = {}
		self.vars["keyboard_hex_code"]["VK_LBUTTON"]  = [0x01, "마우스 왼쪽 버른"]
		self.vars["keyboard_hex_code"]["VK_RBUTTON"] = [0x02, "마우스 오른쪽 버튼"]
		self.vars["keyboard_hex_code"]["VK_CANCEL"] = [0x03, "Ctrl+Break"]
		self.vars["keyboard_hex_code"]["VK_MBUTTON"] = [0x04, "마우스 가운데 버튼"]
		self.vars["keyboard_hex_code"]["VK_XBUTTON1"] = [0x05, "X1 마우스 버튼"]
		self.vars["keyboard_hex_code"]["VK_XBUTTON2"] = [0x06, "X2 마우스 버튼"]
		self.vars["keyboard_hex_code"]["VK_BACK"] = [0x08, "Backspace"]
		self.vars["keyboard_hex_code"]["VK_TAB"] = [0x09, "Tab"]
		self.vars["keyboard_hex_code"]["VK_CLEAR"] = [0x0C, "Clear 키"]
		self.vars["keyboard_hex_code"]["VK_RETURN"] = [0x0D, "Enter"]
		self.vars["keyboard_hex_code"]["VK_SHIFT"] = [0x10, "Shift"]
		self.vars["keyboard_hex_code"]["VK_CONTROL"] = [0x11, "Ctrl"]
		self.vars["keyboard_hex_code"]["VK_MENU"] = [0x12, "Alt"]
		self.vars["keyboard_hex_code"]["VK_PAUSE"] = [0x13, "Pause"]
		self.vars["keyboard_hex_code"]["VK_CAPITAL"] = [0x14, "Caps Lock"]
		self.vars["keyboard_hex_code"]["VK_HANGUEL"] = [0x15, "IME 가나 모드 / 한글 모드"]
		self.vars["keyboard_hex_code"]["VK_KANA"] = [0x15, "IME 가나 모드 / 한글 모드"]
		self.vars["keyboard_hex_code"]["VK_JUNJA"] = [0x17, "IME 전자 모드"]
		self.vars["keyboard_hex_code"]["VK_FINAL"] = [0x18, "IME 최종 모드"]
		self.vars["keyboard_hex_code"]["VK_KANJI"] = [0x19, "IME 한자 모드"]
		self.vars["keyboard_hex_code"]["VK_HANJA"] = [0x19, "IME 한자 모드"]
		self.vars["keyboard_hex_code"]["VK_ESCAPE"] = [0x1B, "Esc"]
		self.vars["keyboard_hex_code"]["VK_CONVERT"] = [0x1C, "IME 변환"]
		self.vars["keyboard_hex_code"]["VK_NONCONVERT"] = [0x1D, "IME 변환 안함"]
		self.vars["keyboard_hex_code"]["VK_ACCEPT"] = [0x1E, "IME 승인"]
		self.vars["keyboard_hex_code"]["VK_MODECHANGE"] = [0x1F, "IME 모드 변경 요청"]
		self.vars["keyboard_hex_code"]["VK_SPACE"] = [0x20, "Space Bar"]
		self.vars["keyboard_hex_code"]["VK_PRIOR"] = [0x21, "Page Up"]
		self.vars["keyboard_hex_code"]["VK_NEXT"] = [0x22, "Page Down"]
		self.vars["keyboard_hex_code"]["VK_END"] = [0x23, "End"]
		self.vars["keyboard_hex_code"]["VK_HOME"] = [0x24, "Home"]
		self.vars["keyboard_hex_code"]["VK_LEFT"] = [0x25, "—"]
		self.vars["keyboard_hex_code"]["VK_UP"] = [0x26, "?"]
		self.vars["keyboard_hex_code"]["VK_RIGHT"] = [0x27, "-"]
		self.vars["keyboard_hex_code"]["VK_DOWN"] = [0x28, "1"]
		self.vars["keyboard_hex_code"]["VK_SELECT"] = [0x29, "Select"]
		self.vars["keyboard_hex_code"]["VK_PRINT"] = [0x2A, "Print"]
		self.vars["keyboard_hex_code"]["VK_EXECUTE"] = [0x2B, "Execute"]
		self.vars["keyboard_hex_code"]["VK_SNAPSHOT"] = [0x2C, "Print Screen"]
		self.vars["keyboard_hex_code"]["VK_INSERT"] = [0x2D, "Insert"]
		self.vars["keyboard_hex_code"]["VK_DELETE"] = [0x2E, "Delete"]
		self.vars["keyboard_hex_code"]["VK_HELP"] = [0x2F, "Help"]
		self.vars["keyboard_hex_code"]["VK_LWIN"] = [0x5B, "왼쪽 윈도우 키"]
		self.vars["keyboard_hex_code"]["VK_RWIN"] = [0x5C, "오른쪽 원도우 키"]
		self.vars["keyboard_hex_code"]["VK_APPS"] = [0x5D, "어플리케이션 키"]
		self.vars["keyboard_hex_code"]["VK_SLEEP"] = [0x5F, "Computer Sleep 키"]
		self.vars["keyboard_hex_code"]["VK_NUMPAD0"] = [0x60, "숫자 키패드 0"]
		self.vars["keyboard_hex_code"]["VK_NUMPAD1"] = [0x61, "숫자 키패드 1"]
		self.vars["keyboard_hex_code"]["VK_NUMPAD2"] = [0x62, "숫자 키패드 2"]
		self.vars["keyboard_hex_code"]["VK_NUMPAD3"] = [0x63, "숫자 키패드 3"]
		self.vars["keyboard_hex_code"]["VK_NUMPAD4"] = [0x64, "숫자 키패드 4"]
		self.vars["keyboard_hex_code"]["VK_NUMPAD5"] = [0x65, "숫자 키패드 5"]
		self.vars["keyboard_hex_code"]["VK_NUMPAD6"] = [0x66, "숫자 키패드 6"]
		self.vars["keyboard_hex_code"]["VK_NUMPAD7"] = [0x67, "숫자 키패드 7"]
		self.vars["keyboard_hex_code"]["VK_NUMPAD8"] = [0x68, "숫자 키패드 8"]
		self.vars["keyboard_hex_code"]["VK_NUMPAD9"] = [0x69, "숫자 키패드 9"]
		self.vars["keyboard_hex_code"]["VK_MULTIPLY"] = [0x6A, "숫자 키패드 *"]
		self.vars["keyboard_hex_code"]["VK_ADD"] = [0x6B, "숫자 키패드+"]
		self.vars["keyboard_hex_code"]["VK_SEPARATOR"] = [0x6C, "Separator 키"]
		self.vars["keyboard_hex_code"]["VK_SUBTRACT"] = [0x6D, "숫자 키패드-"]
		self.vars["keyboard_hex_code"]["VK_DECIMAL"] = [0x6E, "숫자 키패드."]
		self.vars["keyboard_hex_code"]["VK_DEVIDE"] = [0x6F, "숫자 키패드/"]
		self.vars["keyboard_hex_code"]["VK_F1"] = [0x70, "F1"]
		self.vars["keyboard_hex_code"]["VK_F2"] = [0x71, "F2"]
		self.vars["keyboard_hex_code"]["VK_F3"] = [0x72, "F3"]
		self.vars["keyboard_hex_code"]["VK_F4"] = [0x73, "F4"]
		self.vars["keyboard_hex_code"]["VK_F5"] = [0x74, "F5"]
		self.vars["keyboard_hex_code"]["VK_F6"] = [0x75, "F6"]
		self.vars["keyboard_hex_code"]["VK_F7"] = [0x76, "F7"]
		self.vars["keyboard_hex_code"]["VK_F8"] = [0x77, "F8"]
		self.vars["keyboard_hex_code"]["VK_F9"] = [0x78, "F9"]
		self.vars["keyboard_hex_code"]["VK_F10"] = [0x79, "F10"]
		self.vars["keyboard_hex_code"]["VK_F11"] = [0x7A, "F11"]
		self.vars["keyboard_hex_code"]["VK_F12"] = [0x7B, "F12"]
		self.vars["keyboard_hex_code"]["VK_F13"] = [0x7C, "F13"]
		self.vars["keyboard_hex_code"]["VK_F14"] = [0x7D, "F14"]
		self.vars["keyboard_hex_code"]["VK_F15"] = [0x7E, "F15"]
		self.vars["keyboard_hex_code"]["VK_F16"] = [0x7F, "F16"]
		self.vars["keyboard_hex_code"]["VK_F17"] = [0x80, "F17"]
		self.vars["keyboard_hex_code"]["VK_F18"] = [0x81, "F18"]
		self.vars["keyboard_hex_code"]["VK_F19"] = [0x82, "F19"]
		self.vars["keyboard_hex_code"]["VK_F20"] = [0x83, "F20"]
		self.vars["keyboard_hex_code"]["VK_F21"] = [0x84, "F21"]
		self.vars["keyboard_hex_code"]["VK_F22"] = [0x85, "F22"]
		self.vars["keyboard_hex_code"]["VK_F23"] = [0x86, "F23"]
		self.vars["keyboard_hex_code"]["VK_F24"] = [0x87, "F24"]
		self.vars["keyboard_hex_code"]["VK_NUMLOCK"] = [0x90, "Num Lock"]
		self.vars["keyboard_hex_code"]["VK_SCROLL"] = [0x91, "Scroll Lock"]
		self.vars["keyboard_hex_code"]["VK_LSHIFT"] = [0xA0, "왼쪽 Shift"]
		self.vars["keyboard_hex_code"]["VK_RSHIFT"] = [0xA1, "오른쪽 Shift"]
		self.vars["keyboard_hex_code"]["VK_LCONTROL"] = [0xA2, "왼쪽 Ctrl"]
		self.vars["keyboard_hex_code"]["VK_RCONTROL"] = [0xA3, "오른쪽 Ctrl"]
		self.vars["keyboard_hex_code"]["VK_LMENU"] = [0xA4, "왼쪽 Alt"]
		self.vars["keyboard_hex_code"]["VK_RMENU"] = [0xA5, "오른쪽 Alt"]






		self.vars["basic_color_step"] = ["+++++", "++++", "+++", "++", "+", "", "-", "--", "---", "----", "-----"]

		self.vars["check_color_name_eng"] = {
			"빨": "red", "적": "red", "빨강": "red", "red": "red", "r": "red", "빨간색": "red", "빨강색": "red",
			"주": "ora", "주황": "ora", "주황색": "ora", "오렌지": "ora", "yr": "ora", "yellowred": "ora", "yellow_red": "ora", "yel_red": "ora", "yellow red": "ora", "o": "ora", "orange": "ora", "ora": "ora",
			"노": "yel", "노랑": "yel", "노랑색": "yel", "황색": "yel", "y": "yel", "yellow": "yel", "yel": "yel",
			"연": "gre_yel", "연두": "gre_yel", "연두색": "gre_yel", "gre_yel": "gre_yel", "gy": "gre_yel", "greenyellow": "gre_yel", "green_yellow": "gre_yel", "green yellow": "gre_yel", "green-yellow": "gre_yel", "yg": "gre_yel",
			"초": "gre", "초록": "gre", "초록색": "gre", "g": "gre", "green": "gre", "gre": "gre", "녹색": "gre",
			"연초록": "gre_cya", "gre_cya": "gre_cya", "greencyan": "gre_cya", "green_cyan": "gre_cya", "green cyan": "gre_cya", "cg": "gre_cya", "gc": "gre_cya",
			"옥": "cya", "옥색": "cya", "하늘색": "cya", "하늘": "cya", "c": "cya", "cya": "cya", "cyan": "cya",
			"청록": "blu_cya", "청록색": "blu_cya", "청": "blu_cya", "군청색": "blu_cya", "청색": "blu_cya", "blu_cya": "blu_cya", "bluecyan": "blu_cya", "blue_cyan": "blu_cya", "blue cyan": "blu_cya", "cb": "blu_cya", "bg": "blu_cya", "bluegreen": "blu_cya", "bc": "blu_cya",
			"파": "blu", "파랑": "blu", "파랑색": "blu", "b": "blu", "blue": "blu", "blu": "blu",
			"남": "blu_mag", "남색": "blu_mag", "blu_mag": "blu_mag", "bluemagenta": "blu_mag", "blue_magenta": "blu_mag", "blue magenta": "blu_mag", "bm": "blu_mag", "pb": "blu_mag", "purpleblue": "blu_mag", "purple_blue": "blu_mag", "purple blue": "blu_mag",
			"핑크": "pin", "핑크색": "pin", "분홍": "pin", "분홍색": "pin", "pink": "pin","pin": "pin",
			"자홍": "red_mag", "자주": "red_mag", "자주색": "red_mag", "redmagenta": "red_mag",  "red_mag": "red_mag", "red_magenta": "red_mag", "red magenta": "red_mag", "rm": "red_mag", "mr": "red_mag",
			"보": "mag", "보라": "mag", "보라색": "mag", "magenta": "mag", "m": "mag", "mag": "mag", "purple": "mag", "자색": "mag", "violet": "mag", "vio": "mag",
			"회": "gra", "회색": "gra", "gra": "gra", "gray": "gra",
			"흰": "whi", "하양": "whi", "하양색": "whi", "하얀색": "whi", "흰색": "whi", "white": "whi", "whi": "whi",
			"검": "bla", "검정": "bla", "검정색": "bla", "흑": "bla", "흑색": "bla", "black": "bla", "bla": "bla",
			"갈색": "bro", "brown": "bro", "bro": "bro",
			"주홍": "sca", "sca": "sca", "scarlet": "sca", "주홍색": "sca", "선홍색": "sca", "선홍": "sca",
			"연분홍": "pal_pin", "pale_pink": "pal_pin", "pal_pin": "pal_pin",
			"유황색": "sul_yel", "유황": "sul_yel","sul_yel": "sul_yel",
		}

		self.vars["check_color_name_kor"] = {
			"빨": "빨강", "적": "빨강", "red": "빨강", "r": "빨강", "빨간색": "빨강", "빨강색": "빨강",
			"주": "오렌지", "주황": "오렌지", "주황색": "오렌지", "ora": "오렌지", "yr": "오렌지", "yellowred": "오렌지", "yellow_red": "오렌지", "yel_red": "오렌지", "yellow red": "오렌지", "o": "오렌지", "orange": "오렌지",
			"노": "노랑", "노랑": "노랑", "노랑색": "노랑", "황색": "노랑", "y": "노랑", "yellow": "노랑", "yel": "노랑",
			"연": "연두", "연두": "연두", "연두색": "연두", "gy": "연두", "greenyellow": "연두", "green_yellow": "연두", "gre_yel": "연두", "green yellow": "연두", "green-yellow": "연두", "yg": "연두",
			"초": "초록", "초록": "초록", "초록색": "초록", "g": "초록", "녹색": "초록",
			"연초록": "연초록", "greencyan": "연초록", "green_cyan": "연초록", "gre_cya": "연초록", "green cyan": "연초록", "cg": "연초록", "gc": "연초록",
			"옥": "하늘", "옥색": "하늘", "하늘색": "하늘", "하늘": "하늘", "c": "하늘", "cya": "하늘", "cyan": "하늘",
			"청록": "군청색", "청록색": "군청색", "청": "군청색", "군청색": "군청색", "청색": "군청색", "bluecyan": "군청색", "blue_cyan": "군청색", "blu_cya": "군청색", "blue cyan": "군청색", "cb": "군청색", "bg": "군청색", "bluegreen": "군청색",
			"파": "파랑", "파랑": "파랑", "파랑색": "파랑", "b": "파랑", "blue": "파랑", "blu": "파랑",
			"남": "남색", "남색": "남색", "bluemagenta": "남색", "blue_magenta": "남색", "blu_mag": "남색", "blue magenta": "남색", "bm": "남색", "pb": "남색", "purpleblue": "남색", "purple_blue": "남색", "pur_blu": "남색", "purple blue": "남색",
			"핑크": "핑크", "핑크색": "핑크", "분홍": "핑크", "분홍색": "핑크", "pink": "핑크",
			"자홍": "자주", "자주": "자주", "자주색": "자주", "redmagenta": "자주", "red_mag": "자주", "red_magenta": "자주", "red magenta": "자주", "rm": "자주", "mr": "자주",
			"보": "보라", "보라": "보라", "보라색": "보라", "magenta": "보라", "m": "보라", "mag": "보라", "purple": "보라", "자색": "보라", "violet": "보라", "vio": "보라",
			"회": "회색", "회색": "회색", "gra": "회색", "gray": "회색",
			"흰": "하양", "하양": "하양", "하양색": "하양", "하얀색": "하양", "흰색": "하양", "white": "하양", "whi": "하양",
			"검": "검정", "검정": "검정", "검정색": "검정", "흑": "검정", "흑색": "검정", "black": "검정", "bla": "검정",
			"갈색": "갈색", "brown": "갈색", "bro": "갈색",
			"주홍": "주홍", "scarlet": "주홍","sca": "주홍", "주홍색": "주홍", "선홍색": "주홍", "선홍": "주홍",
			"연분홍": "연분홍", "pale_pink": "연분홍","pal_pin": "연분홍",
			"유황색": "유황", "유황": "유황","sulphur_yellow": "유황","sul_yel": "유황",
		}

		self.vars["check_color_name"] = self.vars["check_color_name_eng"]

		self.vars["color_name_for_basic_12_eng"] = ['red', 'ora', 'yel', 'gre_yel', 'gre', 'gre_cya', 'cya', 'blu_cya', 'blu', 'blu_mag', 'pin', 'red_mag']
		#self.vars["color_name_for_all_eng"] = ['bla 0', 'whi 0', 'gra 0', 'red 0', 'ora 30', 'bro 30', 'yel 60', 'gre_yel 90', 'gre 120', 'gre_cya 150', 'sul_yel 150', 'cya 180', 'blu_cya 210', 'blu 240', 'blu_mag 270', 'mag 300', 'pal_pin 303', 'pin 326', 'red_mag 330', 'sca 343']
		self.vars["color_name_for_all_eng"] = list(set(self.vars["check_color_name_eng"].values()))

		self.vars["color_name_for_basic_12_kor"] = ['빨강', '오렌지', '노랑', '연두', '초록', '연초록', '하늘', '군청색', '파랑', '남색', '핑크', '자주']
		self.vars["color_name_for_all_kor"] = list(set(self.vars["check_color_name_kor"].values()))



		#self.vars["color_name_for_all_eng"] = ['bro 30', 'pal_pin 303', 'pin 326', 'sca 343']

		self.vars["color_name_eng_vs_h_no"] = {"red": 0, "ora": 30, "yel": 60, "gre_yel": 90, "gre": 120, "gre_cya": 150 , "cya": 180, "blu_cya": 210, "blu": 240, "blu_mag": 270, "mag": 300, "red_mag": 330, "gra": 0, "whi": 0, "bla": 0, "pin": 326, }
		self.vars["color_name_eng_vs_index"] = {"red": 0, "ora": 1, "yel": 2, "gre_yel": 3, "gre": 4, "gre_cya": 5, "cya": 6, "blu_cya": 7, "blu": 8, "blu_mag": 9, "mag": 10, "red_mag": 11, "gra": 12, "whi": 13, "bla": 14}
		self.vars["color_name_eng_vs_hsl_no"] = {
			"gra": [0, 0, 50], 	"whi": [0, 0, 100], "bla": [0, 0, 0], 	"red": [0, 100, 50],
			"ora": [30, 100, 50], "yel": [60, 100, 50], "gre_yel": [90, 100, 50], 	"gre": [120, 100, 50],
			"gre_cya": [150, 100, 50], "cya": [180, 100, 50], "blu_cya": [210, 100, 50], "blu": [240, 100, 50],
			"blu_mag": [270, 100, 50], "mag": [300, 100, 50], "red_mag": [330, 100, 50], "pin": [326, 75, 56],
			"bro": [30, 100, 40], "sca": [181, 0, 16],	"pal_pin": [348, 95, 84],	"sul_yel": [150, 75, 0],
		}

		self.vars["sl_no_for_12_color_tone"] = [[90, 50], [80, 30], [80, 50], [80, 70], [50, 20], [50, 40], [50, 60], [50, 80], [20, 20], [20, 40], [20, 60], [20, 80]]
		self.vars["color_tone_12_kor_vs_index"] = {"연한": 0, "밝은회색": 1, "회색": 2, "어두운회색": 3, "옅은": 4, "부드러운": 5, "탁한": 6, "어두운": 7, "밝은": 8, "강한": 9, "짙은": 10, "선명한": 11}
		self.vars["color_tone_kor"] = ["연한", "밝은회색", "회색", "어두운회색", "옅은", "부드러운", "탁한", "어두운", "밝은", "강한", "짙은", "선명한"]
		self.vars["color_tone_eng"] = ["pale", "light_grayish", "grayish", "dark_grayish", "light", "soft", "dull", "dark", "bright", "strong", "deep", "vivid"]
		self.vars["color_tone_simple_eng_vs_sl_no"] = {"pastel": [100, 85],"p": [25, 85], "ltg": [25, 65], "g": [25, 35], "dkg": [25, 15],"lt": [50, 80], "sf": [50, 60], "d": [50, 40], "dk": [50, 20],"s": [70, 50], "b": [75, 75], "dp": [75, 25],	"v": [90, 50],}
		self.vars["check_color_tone"] = {
			"파스텔": "pastel", "pastel": "pastel",
			"p": "p", "pale": "p", "pal": "p", "연한": "p",
			"ltg": "ltg", "light_grayish": "ltg", "gra+": "ltg", "밝은회색": "ltg",
			"g": "g", "grayish": "g", "gra": "g", "회색": "g",
			"dkg": "dkg", "dark_grayish": "dkg", "gra-": "dkg", "어두운회색": "dkg",
			"lt": "lt", "light": "lt", "lig": "lt", "옅은": "lt",
			"sf": "sf", "soft": "sf", "sof": "sf", "부드러운": "sf",
			"d": "d", "dull": "d", "dul": "d", "탁한": "d",
			"dk": "dk", "dark": "dk", "dar": "dk", "어두운": "dk",
			"b": "b", "bright": "b", "bri": "b", "밝은": "b",
			"s": "s", "strong": "s", "str": "s", "기본": "s", "강한": "s",
			"dp": "dp", "deep": "dp", "dee": "dp", "짙은": "dp",
			"v": "v", "선명한": "v", "vivid": "v", "viv": "v",
			"black": "black", "검정": "black",
			}

		self.vars["check_change_step"] = {
			0: "0", "0": "0", "l5": "0", "+++++": "0", "pale": "0", "p": "0", "pastel": "0", "파스텔": "0", "d5": "0",
			1: "1", "1": "1", "l4": "1", "++++": "1", "light_grayish": "1", "ltg": "1", "밝은회색": "1", "d4": "1",
			2: "2", "2": "2", "l3": "2", "+++": "2", "light": "2", "lt": "2", "흐린": "2", "옅은": "2", "d3": "2",
			3: "3", "3": "3", "l2": "3", "++": "3", "soft": "3", "sf": "3", "부드러운": "3", "d2": "3",
			4: "4", "4": "4", "l1": "4", "+": "4", "bright": "4", "b": "4", "밝은": "4", "d1": "4",
			5: "5", "5": "5", "l0": "5", "": "5", "strong": "5", "s": "5", "강한": "5", "d0": "5",
			6: "6", "6": "6", "l-1": "6", "-": "6", "deep": "6", "dp": "6", "진한": "6", "d-1": "6",
			7: "7", "7": "7", "l-2": "7", "--": "7", "dull": "7", "d": "7", "탁한": "7", "d-2": "7",
			8: "8", "8": "8", "l-3": "8", "---": "8", "dark": "8", "dk": "8", "어두운": "8", "d-3": "8",
			9: "9", "9": "9", "l-4": "9", "----": "9", "grayish": "9", "g": "9", "회색": "9", "잿빛": "9", "d-4": "9",
			10: "10", "10": "10", "l-5": "10", "-----": "10", "dark_grayish": "10", "dkg": "10", "어두운회색": "10", "d-5": "10",
			}

		self.vars["sl_big_step_vs_sl_no"] = {"1": [100, 80], "2": [100, 77], "3": [100, 68], "4": [100, 59],
		                                         "5": [100, 50], "6": [90, 41], "7": [80, 32], "8": [70, 23], "9": [60, 14] }
		self.vars["sl_small_step_vs_sl_no"] = {"1": [0, 12], "2": [0, 9], "3": [0, 6], "4": [0, 3],
		                                           "5": [0, 0], "6": [0, -3], "7": [0, -6], "8": [0, -9], "9": [0, -12], "0": [0, -14], }
		self.vars["sl_no_for_faber_style"] = [[[100, 0], [100, 50], [0, 0]], [[0, 0], [0, 75], [0, 100]],
					[[100, 0], [25, 75], [0, 100]], [[25, 0], [10, 50], [0, 75]],
					[[100, 0], [0, 0], [0, 100]], [[25, 0], [10, 50], [0, 75], [25, 75]], ]
		self.vars["sl_no_for_basic_10"] = [[100, 0], [90, 10], [80, 20], [70, 30], [60, 40], [50, 50], [40, 60], [30, 70], [10, 80], [10, 90], [0, 100]]
		self.vars["sl_no_for_basic_11"] = [[100, 0], [100, 10], [100, 20], [100, 30], [100, 40], [100, 50], [100, 60], [100, 70], [100, 80], [100, 90], [100, 100]]
		self.vars["sl_small_step_vs_sl_no"] = self.sLstep_small = {"9": [0, 12], "8": [0, 9], "7": [0, 6], "6": [0, 3],
																	"5": [0, 0], "4": [0, -3], "3": [0, -6], "2": [0, -9], "1": [0, -12],
																	"0": [0, -14], }

		self.vars["hsl_no_for_basic_12"] = [[0, 100, 50], [30, 100, 50], [60, 100, 50], [90, 100, 50], [120, 100, 50],
										 [150, 100, 50], [180, 100, 50], [210, 100, 50], [240, 100, 50], [270, 100, 50],
										 [300, 100, 50], [330, 100, 50]]

		self.vars["hsl_no_for_johannes_style"] = [
			[[0, 100, 0], [0, 100, 10], [0, 100, 20], [0, 100, 30], [0, 100, 40], [0, 100, 50], [0, 100, 60], [0, 100, 70],
			 [0, 100, 80], [0, 100, 90], [0, 100, 100]],
			[[30, 100, 0], [30, 100, 10], [30, 100, 20], [30, 100, 30], [30, 100, 40], [30, 100, 50], [30, 100, 60],
			 [30, 100, 70], [30, 100, 80], [30, 100, 90], [30, 100, 100]],
			[[60, 100, 0], [60, 100, 10], [60, 100, 20], [60, 100, 30], [60, 100, 40], [60, 100, 50], [60, 100, 60],
			 [60, 100, 70], [60, 100, 80], [60, 100, 90], [60, 100, 100]],
			[[90, 100, 0], [90, 100, 10], [90, 100, 20], [90, 100, 30], [90, 100, 40], [90, 100, 50], [90, 100, 60],
			 [90, 100, 70], [90, 100, 80], [90, 100, 90], [90, 100, 100]],
			[[120, 100, 0], [120, 100, 10], [120, 100, 20], [120, 100, 30], [120, 100, 40], [120, 100, 50], [120, 100, 60],
			 [120, 100, 70], [120, 100, 80], [120, 100, 90], [120, 100, 100]],
			[[150, 100, 0], [150, 100, 10], [150, 100, 20], [150, 100, 30], [150, 100, 40], [150, 100, 50], [150, 100, 60],
			 [150, 100, 70], [150, 100, 80], [150, 100, 90], [150, 100, 100]],
			[[180, 100, 0], [180, 100, 10], [180, 100, 20], [180, 100, 30], [180, 100, 40], [180, 100, 50], [180, 100, 60],
			 [180, 100, 70], [180, 100, 80], [180, 100, 90], [180, 100, 100]],
			[[210, 100, 0], [210, 100, 10], [210, 100, 20], [210, 100, 30], [210, 100, 40], [210, 100, 50], [210, 100, 60],
			 [210, 100, 70], [210, 100, 80], [210, 100, 90], [210, 100, 100]],
			[[240, 100, 0], [240, 100, 10], [240, 100, 20], [240, 100, 30], [240, 100, 40], [240, 100, 50], [240, 100, 60],
			 [240, 100, 70], [240, 100, 80], [240, 100, 90], [240, 100, 100]],
			[[270, 100, 0], [270, 100, 10], [270, 100, 20], [270, 100, 30], [270, 100, 40], [270, 100, 50], [270, 100, 60],
			 [270, 100, 70], [270, 100, 80], [270, 100, 90], [270, 100, 100]],
			[[300, 100, 0], [300, 100, 10], [300, 100, 20], [300, 100, 30], [300, 100, 40], [300, 100, 50], [300, 100, 60],
			 [300, 100, 70], [300, 100, 80], [300, 100, 90], [300, 100, 100]],
			[[330, 100, 0], [330, 100, 10], [330, 100, 20], [330, 100, 30], [330, 100, 40], [330, 100, 50], [330, 100, 60],
			 [330, 100, 70], [330, 100, 80], [330, 100, 90], [330, 100, 100]]]

		self.vars["rgb_46_for_excel"] = [[255, 0, 0], [0, 255, 0], [0, 0, 255], [255, 255, 0], [255, 0, 255],
					 [0, 255, 255], [153, 51, 102], [255, 255, 204], [204, 255, 255], [102, 0, 102],
					 [255, 128, 128], [0, 102, 204], [204, 204, 255], [0, 204, 255], [204, 255, 204],
					 [255, 255, 153], [153, 204, 255], [255, 153, 204], [204, 153, 255], [255, 204, 153],
					 [51, 102, 255], [51, 204, 204], [153, 204, 0], [255, 204, 0], [255, 153, 0],
					 [255, 102, 0], [102, 102, 153], [150, 150, 150], [0, 51, 102], [51, 153, 102],
					 [0, 51, 0], [51, 51, 0], [153, 51, 0], [51, 51, 153], [51, 51, 51],
					 [128, 0, 0], [0, 128, 0], [0, 0, 128], [128, 128, 0], [128, 0, 128],
					 [0, 128, 128], [192, 192, 192], [128, 128, 128], [153, 153, 255], [0, 0, 0],
					 [255, 255, 255]]

		self.vars["rgb_for_basic_12"] = [[255, 0, 0], [255, 128, 0], [255, 255, 0], [128, 255, 0],
										[0, 255, 0], [0, 255, 128], [0, 255, 255], [0, 128, 255],
										[0, 0, 255], [128, 0, 255], [255, 0, 255], [255, 0, 128], ]

		self.vars["excel_colorindex_vs_rgb_no"] = {
			1: [0, 0, 0], 2: [255, 255, 255], 3: [255, 0, 0], 4: [0, 255, 0], 5: [0, 0, 255],
			6: [255, 255, 0], 7: [255, 0, 255], 8: [0, 255, 255], 9: [128, 0, 0], 10: [0, 128, 0],
			11: [0, 0, 128], 12: [128, 128, 0], 13: [128, 0, 128], 14: [0, 128, 128], 15: [192, 192, 192],
			16: [128, 128, 128], 17: [153, 153, 255], 18: [153, 51, 102], 19: [255, 255, 204], 20: [204, 255, 255],
			21: [102, 0, 102], 22: [255, 128, 128], 23: [0, 102, 204], 24: [204, 204, 255], 25: [0, 0, 128],
			26: [255, 0, 255], 27: [255, 255, 0], 28: [0, 255, 255], 29: [128, 0, 128], 30: [128, 0, 0],
			31: [0, 128, 128], 32: [0, 0, 255], 33: [0, 204, 255], 34: [204, 255, 255], 35: [204, 255, 204],
			36: [255, 255, 153], 37: [153, 204, 255], 38: [255, 153, 204], 39: [204, 153, 255], 40: [255, 204, 153],
			41: [51, 102, 255], 42: [51, 204, 204], 43: [153, 204, 0], 44: [255, 204, 0], 45: [255, 153, 0],
			46: [255, 102, 0], 47: [102, 102, 153], 48: [150, 150, 150], 49: [0, 51, 102], 50: [51, 153, 102],
			51: [0, 51, 0], 52: [51, 51, 0], 53: [153, 51, 0], 54: [153, 51, 102], 55: [51, 51, 153],
			56: [51, 51, 51], }

		self.vars["rgb_56_for_excel"] = []
		self.vars["excel_colorindex_vs_rgbint"] = {}
		for key in self.vars["excel_colorindex_vs_rgb_no"].keys():
			value = self.vars["excel_colorindex_vs_rgb_no"][key]
			self.vars["rgb_56_for_excel"].append(value)
			self.vars["excel_colorindex_vs_rgbint"][value[0]*256*256 +value[1]*256 + value[2]] = key


		self.vars["excel_colorindex_vs_color_name"] = {
			1: "검정색", 	2: "흰색", 3: "빨강색", 5: "파랑색", 6: "노랑색",
			7: "핑크색", 46: "오렌지", 13: "보라색", 14: "청록색", 19: "옅은노랑",
			20: "옅은하늘", 18: "매실색", 8: "밝은하늘", 4: "연두색", 15: "회색20",
			48: "회색40", 16: "회색60", 56: "회색80", 9: "진한적색", 10: "진한녹색",
			11: "진한청색", 12: "진한황색", 21: "진한보라", 33: "진한하늘", 49: "진한산호색",
			17: "담자색", 45: "토황색", 35: "취람색", 36: "송화색", 40: "두록색",
			22: "주색", 23: "청현색", 24: "회보라색", 37: "밝은벽청색", 38: "선홍색", 47: "치색",
		}

		self.vars["+-_value_vs_sl_no"] = {"+++++": [0, 15], "++++": [0, 12], "+++": [0, 9], "++": [0, 6], "+": [0, 3], "-": [0, -3],
					"--": [0, -6], "---": [0, -9], "----": [0, -12], "-----": [0, -14], }
		self.vars["h_no_for_basic_12"] =[0, 30, 60, 90, 120, 150, 180, 210, 240, 270, 300, 330]
		self.vars["excel_line_style_dic"] = {
		                                     "basic": 1, "": 1, "-": 1,
		                                     ".": -4118, "-.": 4, "-..": 5,
		                                     "..": -4115, "=": 4119, "no": -4142, "/..": 13, }
		self.vars["excel_line_thickness_dic"] = {
			"-1": 1, "매우가는선": 1, "0": 2, "": 2, "basic": 2, "가는선": 2,
			"1": -4138, "일반선": 4138, "2": 4, "굵은선": 4,
			"4": 1, "5": 2, "6": -4138, "7": 4,
			"실선": -4138, "진한선": 4,}

		self.vars["excel_line_position"] = {
		                                    "l": [7], "left": [7], "왼쪽": [7],
		                                    "t": [8], "top": [8], "위쪽": [8],
		                                    "b": [9], "bottom": [9], "아래쪽": [9],
		                                    "r": [10], "right": [10], "오른쪽": [10],
		                                    "h": [11], "inside-h": [11], "inh": [11], "안쪽세로": [11], "|": [11],
		                                    "v": [12], "inside-v": [12], "inv": [12], "안쪽가로": [12], "-": [12],
		                                    "a": [7, 8, 9, 10, 11, 12], "all": [7, 8, 9, 10, 11, 12],
		                                    "전부": [7, 8, 9, 10, 11, 12],
		                                    "o": [7, 8, 9, 10], "테두리": [7, 8, 9, 10], "": [7, 8, 9, 10],
		                                    "basic": [7, 8, 9, 10],
		                                    "out": [7, 8, 9, 10],
		                                    "/": [6], "대각선오른쪽": [6],
		                                    "\\": [5], "대각선왼쪽": [5],
		                                    "in": [11, 12],
		                                    "total": [5, 6, 7, 8, 9, 10, 11, 12],
		                 }

		self.vars["excel_colorname_vs_colorindex"] = {
			"bla": 1, "whi": 2, "blu": 5, "yel": 6,
			"pin": 7, "ora": 46, "pur": 13, "gre": 14, "gra": 15,
			"검정색": 1, "흰색": 2, "빨강색": 3, "파랑색": 5, "노랑색": 6,
			"핑크색": 7, "오렌지": 46, "보라색": 13, "청록색": 14, "옅은노랑": 19,
			"옅은하늘": 20, "매실색": 18, "밝은하늘": 8, "연두색": 4, "회색20": 15,
			"회색40": 48, "회색60": 16, "회색80": 56, "진한적색": 9, "진한녹색": 10,
			"진한청색": 11, "진한황색": 12, "진한보라": 21, "진한하늘": 33, "진한산호색": 49,
			"담자색": 17, "토황색": 45, "취람색": 35, "송화색": 36, "두록색": 40,
			"주색": 22, "청현색": 23, "회보라색": 24, "밝은벽청색": 37, "선홍색": 38, "치색": 47,
			"black": 1, "white": 2, "red": 3, "blue": 5, "yellow": 6,
			"pink": 7, "orange": 46, "purple": 13, "green": 14, "gray": 15,
			1: "bla", 2: "whi", 5: "blu", 6: "yel",
			7: "pin", 46: "ora", 13: "pur", 14: "gre", 15: "gra",
		}

		#self.vars["excel_rgblist_vs_colorindex"] = {[0, 0, 0]: 1, [255, 255, 255]: 2, [255, 0, 0]: 3, [0, 255, 0]: 4, [0, 0, 255]: 5,
		#		 [255, 255, 0]: 6, [255, 0, 255]: 7, [0, 255, 255]: 8, [128, 0, 0]: 9, [0, 128, 0]: 10,
		#		 [0, 0, 128]: 11, [128, 128, 0]: 12, [128, 0, 128]: 13, [0, 128, 128]: 14, [192, 192, 192]: 15,
		#		 [128, 128, 128]: 16, [153, 153, 255]: 17, [153, 51, 102]: 18, [255, 255, 204]: 19, [204, 255, 255]: 20,
		#		 [102, 0, 102]: 21, [255, 128, 128]: 22, [0, 102, 204]: 23, [204, 204, 255]: 24, [0, 0, 128]: 25,
		#		 [255, 0, 255]: 26, [255, 255, 0]: 27, [0, 255, 255]: 28, [128, 0, 128]: 29, [128, 0, 0]: 30,
		#		 [0, 128, 128]: 31, [0, 0, 255]: 32, [0, 204, 255]: 33, [204, 255, 255]: 34, [204, 255, 204]: 35,
		#		 [255, 255, 153]: 36, [153, 204, 255]: 37, [255, 153, 204]: 38, [204, 153, 255]: 39,
		#		 [255, 204, 153]: 40,
		#		 [51, 102, 255]: 41, [51, 204, 204]: 42, [153, 204, 0]: 43, [255, 204, 0]: 44, [255, 153, 0]: 45,
		#		 [255, 102, 0]: 46, [102, 102, 153]: 47, [150, 150, 150]: 48, [0, 51, 102]: 49, [51, 153, 102]: 50,
		#		 [0, 51, 0]: 51, [51, 51, 0]: 52, [153, 51, 0]: 53, [153, 51, 102]: 54, [51, 51, 153]: 55,
		#		 [51, 51, 51]: 56, }

		#기본 색스타일을 기본스타일로 변경하는 것이다
		self.vars["dic_check_colorstyle"] = {"v": "v", "b": "b", "s": "s", "dp": "dp", "lt": "lt", "sf": "sf", "d": "d", "dk": "dk", "p": "p", "ltg": "ltg", "g": "g", "dkg": "dkg",
				"vivid": "v", "bright": "b", "strong": "s", "deep": "dp", "light": "lt", "soft": "sf", "dull": "d", "dark": "dk", "pale": "p", "lightgrayish": "ltg", "grayish": "g", "darkgrayish": "dkg",
				"viv": "v", "bri": "b", "str": "s", "dee": "dp", "lig": "lt", "sof": "sf", "dul": "d", "dar": "dk", "pal": "p", "gra+": "ltg", "gra": "g", "gra-": "dkg",
				"선명한": "v", "밝은": "b", "강한": "s", "짙은": "dp", "옅은": "lt", "부드러운": "sf", "둔한": "d", "어두운": "dk", "연한": "p", "밝은회색조": "ltg", "회색조": "g", "어두운회색조": "dkg"}

		#자주 사용하는 색의 이름을 기본색 이름으로 변경하는 것이다
		self.vars["dic_check_colorname"] = {
			"빨": "red", "적": "red", "red": "red", "r": "red", "빨강": "red", 0: "red",
			"주": "ora", "yr": "ora", "yellowred": "ora", "o": "ora", "orange": "ora", "ora": "ora", "주황": "ora", 1: "ora", 30: "ora",
			"노": "yel", "y": "yel", "yellow": "yel", "yel": "yel", "노랑": "yel", 2: "yel", 60: "yel",
			"연": "gre_yel", "gre_yel": "gre_yel", "greenyellow": "gre_yel", "연두": "gre_yel", "green-yellow": "gre_yel", "yg": "gre_yel", 3: "gre_yel", 90: "gre_yel",
			"초": "gre", "g": "gre", "green": "gre", "gre": "gre", "녹색": "gre", "초록": "gre", 4: "gre", 120: "gre",
			"연초록": "gre_cya", "green-cyan": "gre_cya", "cg": "gre_cya", "gc": "gre_cya", 5: "gre_cya", 150: "gre_cya",
			"옥": "cya", "옥색": "cya", "c": "cya", "cya": "cya", "cyan": "cya", 6: "cya", 180: "cya",
			"청록": "blu_cya", "blue-cyan": "blu_cya", "청": "blu_cya", "cb": "blu_cya", "bg": "blu_cya", "bluegreen": "blu_cya", "blu_cya": "blu_cya", 7: "blu_cya", 210: "blu_cya",
			"파": "blu", "b": "blu", "blue": "blu", "blu": "blu", "파랑": "blu", 8: "blu", 240: "blu",
			"남": "blu_mag", "blue-magenta": "blu_mag", "blue_magenta": "blu_mag", "mb": "blu_mag", "blu_mag": "blu_mag", "pb": "blu_mag", "purpleblue": "blu_mag", "violet": "blu_mag", "vio": "blu_mag", "남색": "blu_mag", 9: "blu_mag", 270: "blu_mag",
			"보": "mag", "magenta": "mag", "m": "mag", "보라": "mag", "mag": "mag", 10: "mag", 300: "mag",
			"자홍": "red_mag", "red-magenta": "red_mag", "red_mag": "red_mag", "red_magenta": "red_mag", "mr": "red_mag", "자주": "red_mag", 11: "red_mag", 330: "red_mag",
			"회": "gra", "회색": "gra", "gra": "gra", "gray": "gra", 12: "gra",
			"흰": "whi", "하양": "whi", "white": "whi", "whi": "whi", "흰색": "whi", 13: "whi",
			"검": "bla", "검정": "bla", "black": "bla", "흑": "bla", "bla": "bla", 14: "bla",
			}

		#컬러의 강도를 확인하는것
		self.vars["dic_check_colorstrong"] = {
			55: "55", "55": "55", "ls": "55", "strong": "55", "s": "55", "강한": "55", "기준": "55",
			0: "0", "0": "0", "l5": "0", "+++++": "0", "pale": "0", "p": "0", "pastel": "0", "파스텔": "0", "d5": "0",
			1: "1", "1": "1", "l4": "1", "++++": "1", "light grayish": "1", "ltg": "1", "d4": "1",
			2: "2", "2": "2", "l3": "2", "+++": "2", "light": "2", "lt": "2", "흐린": "2", "가벼운": "2", "d3": "2",
			3: "3", "3": "3", "l2": "3", "++": "3", "soft": "3", "sf": "3", "연한": "3", "d2": "3",
			4: "4", "4": "4", "l1": "4", "+": "4", "bright": "4", "b": "4", "밝은": "4", "d1": "4",
			5: "5", "5": "5", "l0": "5", "": "5", "vivid": "5", "v": "5", "선명한": "5", "basic": "5", "기본": "5", "d0": "5",
			6: "6", "6": "6", "l-1": "6", "-": "6", "deep": "6", "dp": "6", "진한": "6", "d-1": "6",
			7: "7", "7": "7", "l-2": "7", "--": "7", "dull": "7", "d": "7", "탁한": "7", "d-2": "7",
			8: "8", "8": "8", "l-3": "8", "---": "8", "dark": "8", "dk": "8", "어두운": "8", "d-3": "8",
			9: "9", "9": "9", "l-4": "9", "----": "9", "grayish": "9", "g": "9", "회색빛": "9", "잿빛": "9", "d-4": "9",
			10: "10", "10": "10", "l-5": "10", "-----": "10", "dark grayish": "10", "dkg": "10", "어두운 회색": "10", "d-5": "10",
			}

		self.vars["dic_colorname_colornum_forexcel"] = {
			"검정색": 1, 	"흰색": 2, "빨강색": 3, "파랑색": 5, "노랑색": 6,
			"핑크색": 7, "오렌지": 46, "보라색": 13, "청록색": 14, "옅은노랑": 19,
			"옅은하늘": 20, "매실색": 18, "밝은하늘": 8, "연두색": 4, "회색20": 15,
			"회색40": 48, "회색60": 16, "회색80": 56, "진한적색": 9, "진한녹색": 10,
			"진한청색": 11, "진한황색": 12, "진한보라": 21, "진한하늘": 33, "진한산호색": 49,
			"담자색": 17, "토황색": 45, "취람색": 35, "송화색": 36, "두록색": 40,
			"주색": 22, "청현색": 23, "회보라색": 24, "밝은벽청색": 37, "선홍색": 38, "치색": 47,
			"black": 1, "white": 2, "red": 3, "blue": 5, "yellow": 6,
			"pink": 7, "orange": 46, "purple": 13, "green": 14, "gray": 15,
			"bla": 1, "whi": 2, "blu": 5, "yel": 6,
			"pin": 7, "ora": 46, "pur": 13, "gre": 14, "gra": 15,
		}

		self.vars["dic_colorname_colorindex"] = {
			"검정": 1, 	"흰색": 2, "빨강": 3, "파랑": 5, "노랑": 6,
			"핑크": 7, "오렌지": 46, "보라": 13, "청록": 14, "회색": 15,
			"black": 1, "white": 2, "red": 3, "blue": 5, "yellow": 6,
			"pink": 7, "orange": 46, "purple": 13, "green": 14, "gray": 15,
			"bla": 1, "whi": 2, "blu": 5, "yel": 6,
			"pin": 7, "ora": 46, "pur": 13, "gre": 14, "gra": 15,
		}
		self.vars["dic_colorindex_rgblist"] = {
			1: [0, 0, 0], 2: [255, 255, 255], 3: [255, 0, 0], 4: [0, 255, 0], 5: [0, 0, 255],
			6: [255, 255, 0], 7: [255, 0, 255], 8: [0, 255, 255], 9: [128, 0, 0], 10: [0, 128, 0],
			11: [0, 0, 128], 12: [128, 128, 0], 13: [128, 0, 128], 14: [0, 128, 128], 15: [192, 192, 192],
			16: [128, 128, 128], 17: [153, 153, 255], 18: [153, 51, 102], 19: [255, 255, 204], 20: [204, 255, 255],
			21: [102, 0, 102], 22: [255, 128, 128], 23: [0, 102, 204], 24: [204, 204, 255], 25: [0, 0, 128],
			26: [255, 0, 255], 27: [255, 255, 0], 28: [0, 255, 255], 29: [128, 0, 128], 30: [128, 0, 0],
			31: [0, 128, 128], 32: [0, 0, 255], 33: [0, 204, 255], 34: [204, 255, 255], 35: [204, 255, 204],
			36: [255, 255, 153], 37: [153, 204, 255], 38: [255, 153, 204], 39: [204, 153, 255], 40: [255, 204, 153],
			41: [51, 102, 255], 42: [51, 204, 204], 43: [153, 204, 0], 44: [255, 204, 0], 45: [255, 153, 0],
			46: [255, 102, 0], 47: [102, 102, 153], 48: [150, 150, 150], 49: [0, 51, 102], 50: [51, 153, 102],
			51: [0, 51, 0], 52: [51, 51, 0], 53: [153, 51, 0], 54: [153, 51, 102], 55: [51, 51, 153],
			56: [51, 51, 51], }

		self.vars["list_46rgb_forexcel"] = [[255, 0, 0], [0, 255, 0], [0, 0, 255], [255, 255, 0], [255, 0, 255],
					 [0, 255, 255], [153, 51, 102], [255, 255, 204], [204, 255, 255], [102, 0, 102],
					 [255, 128, 128], [0, 102, 204], [204, 204, 255], [0, 204, 255], [204, 255, 204],
					 [255, 255, 153], [153, 204, 255], [255, 153, 204], [204, 153, 255], [255, 204, 153],
					 [51, 102, 255], [51, 204, 204], [153, 204, 0], [255, 204, 0], [255, 153, 0],
					 [255, 102, 0], [102, 102, 153], [150, 150, 150], [0, 51, 102], [51, 153, 102],
					 [0, 51, 0], [51, 51, 0], [153, 51, 0], [51, 51, 153], [51, 51, 51],
					 [128, 0, 0], [0, 128, 0], [0, 0, 128], [128, 128, 0], [128, 0, 128],
					 [0, 128, 128], [192, 192, 192], [128, 128, 128], [153, 153, 255], [0, 0, 0],
					 [255, 255, 255]]


		self.vars["dic_colornum_colorname_forexcel"] = {
			1: "검정색", 	2: "흰색", 3: "빨강색", 5: "파랑색", 6: "노랑색",
			7: "핑크색", 46: "오렌지", 13: "보라색", 14: "청록색", 19: "옅은노랑",
			20: "옅은하늘", 18: "매실색", 8: "밝은하늘", 4: "연두색", 15: "회색20",
			48: "회색40", 16: "회색60", 56: "회색80", 9: "진한적색", 10: "진한녹색",
			11: "진한청색", 12: "진한황색", 21: "진한보라", 33: "진한하늘", 49: "진한산호색",
			17: "담자색", 45: "토황색", 35: "취람색", 36: "송화색", 40: "두록색",
			22: "주색", 23: "청현색", 24: "회보라색", 37: "밝은벽청색", 38: "선홍색", 47: "치색",
		}

		self.vars["dic_check_colormode"] ={1: "단색조합", "단색조합": 1, "강력한 대기효과와 넓은공간감": 1,
							  2: "등간격 3색 조화", "등간격 3색 조화": 2, "활동적인 인상과 이미지": 2,
							  3: "보색", "보색": 3, "강력한비교": 3,
							  4: "인접색", "인접색": 4, "비슷한색 찾기": 4,
							  5: "근접보색조합", "근접보색조합": 5, "보색의 강한 인상이 부담스러울때 보색의 근처에있는 색": 5,
							  6: "고명도배색", "고명도배색": 6,
							  7: "고명도배색+약간더 부드러운 이미지", "고명도배색+약간더 부드러운 이미지": 7,
							  8: "중명도배색", "중명도배색": 8,
							  9: "중명도배색+약간더 부드러운 이미지", "중명도배색+약간더 부드러운 이미지": 9,
							  10: "저중명도배색", "저중명도배색": 10,
							  11: "저명도배색+약간더 어두운 이미지", "저명도배색+약간더 어두운 이미지": 11,
							  12: "명도차가 큰 배색", "명도차가 큰 배색": 12,
							  13: "명도차가 큰 배색 + 근접보색", "명도차가 큰 배색 + 근접보색": 13,
							  14: "고채도 배색", "고채도 배색": 14,
							  15: "채도차가 큰 배색", "채도차가 큰 배색": 15,
							  16: "저채도 배색", "저채도 배색": 16, "차분하고 무거운 이미지": 16,
							  }

		self.vars["dic_color_index"] = {"red": 0, "ora": 1, "yel": 2, "yg": 3, "gre": 4, "gre_cya": 5, "cya": 6, "cb": 7, "blu": 8, "blu_mag": 9, "mag": 10, "mr": 11, "gra": 12, "whi": 13, "bla": 14}


		self.vars["dic_num_sstep"] = {"1": [10], "2": [20], "3": [30], "4": [40], "5": [50], "6": [60], "7": [70], "8": [80], "9": [90], }

		self.vars["dic_num_lstep"] = {"1": [10], "2": [20], "3": [30], "4": [40], "5": [50], "6": [60], "7": [70], "8": [80], "9": [90], }

		self.vars["dic_linethick_num_forexcel"] = {"hairline": 1, "basic": -4138, "thick": 4, "thin": 2, "t-2": 1, "t0": -4138, "t1": 4, "t-1": 2, "매우가는선": 1, "일반": -4138, "굵은선": 4, "가는선": 2, }

		self.vars["dic_lineposition_num_forexcel"] = {"/": 6, "\\": 5, "left": 7, "top": 8, "bottom": 9, "right": 10, "inside-h": 11, "inside-v": 12, "대각선오른쪽": 6, "대각선왼쪽": 5, "왼쪽": 7, "위쪽": 8, "아래쪽": 9, "오른쪽": 10, "안쪽세로": 11, "안쪽가로": 12, }

		self.vars["dic_linestyle_num_forexcel"] = {"basic": 1, "-": -4115, "-.": 4, "-..": 5, ".": -4118, "=": -4119, "no": -4142, "/.": 13, "실선": 1, "점선": 2, "가는점선": 1, "굵은실선": 6, }

		self.vars["dic_colorname_hnum"] = {"red": 0, "ora": 30, "yel": 60, "gre_yel": 90, "gre": 120, "gre_cya": 150 , "cya": 180, "blu_cya": 210, "blu": 240, "blu_mag": 270, "mag": 300, "red_mag": 330, "gra": 0, "whi": 0, "bla": 0, }

		self.vars["dic_num_slstep_small"] = {"1": [0, 12], "2": [0, 9], "3": [0, 6], "4": [0, 3], "5": [0, 0], "6": [0, -3], "7": [0, -6], "8": [0, -9], "9": [0, -12], "0": [0, -14], }
		self.vars["dic_num_slstep"] = {"1": [100, 80], "2": [100, 77], "3": [100, 68], "4": [100, 59], "5": [100, 50], "6": [90, 41], "7": [80, 32], "8": [70, 23], "9": [60, 14] }


		self.vars["list_colorname_pccs"] = ["v", "b", "s", "dp", "lt", "sf", "d", "dk", "p", "ltg", "g", "dkg"]

		self.vars["list_colorname_kor"] = ["빨강", "주황", "노랑", "연두", "초록", "연초록", "옥색", "청록", "파랑", "남색", "보라", "자홍", "회색", "흰색", "검정"]
		self.vars["list_colorname_eng"] = ["red", "ora", "yel", "gre_yel", "gre", "gre_cya", "cya", "blu_cya", "blu", "blu_mag", "mag", "red_mag", "gra", "whi", "bla"]
		self.vars["list_colorname_eng_short"] = ["r", "o", "y", "gre_yel", "g", "gre_cya", "c", "blu_cya", "b", "blu_mag", "m", "red_mag", "g", "w", "bl"]

		self.vars["list_colorstyle_eng"] = ["vivid", "bright", "strong", "deep", "light", "soft", "dull", "dark", "pale", "lightgrayish", "grayish", "darkgrayish"]
		self.vars["list_colorstyle_kor"] = ["파스텔", "연한", "밝은", "흐린", "선명한", "기본", "탁한", "진한", "어두운", "회색", "검은", "검정"]
		self.vars["list_colorstyle_eng"] = ["white", "pale", "light", "soft", "vivid", "dull", "deep", "dark", "black", "gray"]

		self.vars["list_colorstyle_slno"] = [[90, 50], [80, 30], [80, 50], [80, 70], [50, 20], [50, 40], [50, 60], [50, 80], [20, 20], [20, 40], [20, 60], [20, 80]]

		self.vars["list_colormode_kor"]= ["단색조합", "등간격 3색 조화", "보색", "인접색", "근접보색조합",
							   "고명도배색", "고명도배색+약간더 부드러운 이미지",
							   "중명도배색", "중명도배색+약간더 부드러운 이미지", "저중명도배색", "저명도배색+약간더 어두운 이미지",
							   "명도차가 큰 배색", "명도차가 큰 배색 + 근접보색",
							   "고채도 배색", "채도차가 큰 배색", "저채도 배색", ]

		self.vars["list_56rgb_forexcel"] = [[0, 0, 0], [255, 255, 255], [255, 0, 0], [0, 255, 0], [0, 0, 255], [255, 255, 0],
										[255, 0, 255], [0, 255, 255], [128, 0, 0], [0, 128, 0], [0, 0, 128], [128, 128, 0],
										[128, 0, 128], [0, 128, 128], [192, 192, 192], [128, 128, 128], [153, 153, 255],
										[153, 51, 102], [255, 255, 204], [204, 255, 255], [102, 0, 102], [255, 128, 128],
										[0, 102, 204], [204, 204, 255], [0, 0, 128], [255, 0, 255], [255, 255, 0],
										[0, 255, 255], [128, 0, 128], [128, 0, 0], [0, 128, 128], [0, 0, 255],
										[0, 204, 255], [204, 255, 255], [204, 255, 204], [255, 255, 153], [153, 204, 255],
										[255, 153, 204], [204, 153, 255], [255, 204, 153], [51, 102, 255], [51, 204, 204],
										[153, 204, 0], [255, 204, 0], [255, 153, 0], [255, 102, 0], [102, 102, 153],
										[150, 150, 150], [0, 51, 102], [51, 153, 102], [0, 51, 0], [51, 51, 0],
										[153, 51, 0], [153, 51, 102], [51, 51, 153], [51, 51, 51]]

		self.vars["list_46rgb_forexcel"] = [[255, 0, 0], [0, 255, 0], [0, 0, 255], [255, 255, 0], [255, 0, 255],
					 [0, 255, 255], [153, 51, 102], [255, 255, 204], [204, 255, 255], [102, 0, 102],
					 [255, 128, 128], [0, 102, 204], [204, 204, 255], [0, 204, 255], [204, 255, 204],
					 [255, 255, 153], [153, 204, 255], [255, 153, 204], [204, 153, 255], [255, 204, 153],
					 [51, 102, 255], [51, 204, 204], [153, 204, 0], [255, 204, 0], [255, 153, 0],
					 [255, 102, 0], [102, 102, 153], [150, 150, 150], [0, 51, 102], [51, 153, 102],
					 [0, 51, 0], [51, 51, 0], [153, 51, 0], [51, 51, 153], [51, 51, 51],
					 [128, 0, 0], [0, 128, 0], [0, 0, 128], [128, 128, 0], [128, 0, 128],
					 [0, 128, 128], [192, 192, 192], [128, 128, 128], [153, 153, 255], [0, 0, 0],
					 [255, 255, 255]]

		self.vars["list_basic_12rgb"] = [[255, 0, 0], [255, 128, 0], [255, 255, 0], [128, 255, 0],
										[0, 255, 0], [0, 255, 128], [0, 255, 255], [0, 128, 255],
										[0, 0, 255], [128, 0, 255], [255, 0, 255], [255, 0, 128], ]

		self.vars["list_basic_12hsl"] = [[0, 100, 50], [30, 100, 50], [60, 100, 50], [90, 100, 50], [120, 100, 50],
										 [150, 100, 50], [180, 100, 50], [210, 100, 50], [240, 100, 50], [270, 100, 50],
										 [300, 100, 50], [330, 100, 50]]

		self.vars["list_basic_12h"] = [0, 30, 60, 90, 120, 150, 180, 210, 240, 270, 300, 330]

		self.vars["list_basic_10sl"] = [[100, 0], [90, 10], [80, 20], [70, 30], [60, 40], [50, 50], [40, 60], [30, 70], [10, 80], [10, 90], [0, 100]]

		self.vars["list_basic_11sl"] = [[100, 0], [100, 10], [100, 20], [100, 30], [100, 40], [100, 50], [100, 60], [100, 70], [100, 80], [100, 90], [100, 100]]

		self.vars["list_basic_12colorstyle"] = [[90, 50], [80, 30], [80, 50], [80, 70], [50, 20], [50, 40], [50, 60], [50, 80], [20, 20], [20, 40], [20, 60], [20, 80]]

		self.vars["list_johannes_hsl"] = [
			[[0, 100, 0], [0, 100, 10], [0, 100, 20], [0, 100, 30], [0, 100, 40], [0, 100, 50], [0, 100, 60], [0, 100, 70],
			 [0, 100, 80], [0, 100, 90], [0, 100, 100]],
			[[30, 100, 0], [30, 100, 10], [30, 100, 20], [30, 100, 30], [30, 100, 40], [30, 100, 50], [30, 100, 60],
			 [30, 100, 70], [30, 100, 80], [30, 100, 90], [30, 100, 100]],
			[[60, 100, 0], [60, 100, 10], [60, 100, 20], [60, 100, 30], [60, 100, 40], [60, 100, 50], [60, 100, 60],
			 [60, 100, 70], [60, 100, 80], [60, 100, 90], [60, 100, 100]],
			[[90, 100, 0], [90, 100, 10], [90, 100, 20], [90, 100, 30], [90, 100, 40], [90, 100, 50], [90, 100, 60],
			 [90, 100, 70], [90, 100, 80], [90, 100, 90], [90, 100, 100]],
			[[120, 100, 0], [120, 100, 10], [120, 100, 20], [120, 100, 30], [120, 100, 40], [120, 100, 50], [120, 100, 60],
			 [120, 100, 70], [120, 100, 80], [120, 100, 90], [120, 100, 100]],
			[[150, 100, 0], [150, 100, 10], [150, 100, 20], [150, 100, 30], [150, 100, 40], [150, 100, 50], [150, 100, 60],
			 [150, 100, 70], [150, 100, 80], [150, 100, 90], [150, 100, 100]],
			[[180, 100, 0], [180, 100, 10], [180, 100, 20], [180, 100, 30], [180, 100, 40], [180, 100, 50], [180, 100, 60],
			 [180, 100, 70], [180, 100, 80], [180, 100, 90], [180, 100, 100]],
			[[210, 100, 0], [210, 100, 10], [210, 100, 20], [210, 100, 30], [210, 100, 40], [210, 100, 50], [210, 100, 60],
			 [210, 100, 70], [210, 100, 80], [210, 100, 90], [210, 100, 100]],
			[[240, 100, 0], [240, 100, 10], [240, 100, 20], [240, 100, 30], [240, 100, 40], [240, 100, 50], [240, 100, 60],
			 [240, 100, 70], [240, 100, 80], [240, 100, 90], [240, 100, 100]],
			[[270, 100, 0], [270, 100, 10], [270, 100, 20], [270, 100, 30], [270, 100, 40], [270, 100, 50], [270, 100, 60],
			 [270, 100, 70], [270, 100, 80], [270, 100, 90], [270, 100, 100]],
			[[300, 100, 0], [300, 100, 10], [300, 100, 20], [300, 100, 30], [300, 100, 40], [300, 100, 50], [300, 100, 60],
			 [300, 100, 70], [300, 100, 80], [300, 100, 90], [300, 100, 100]],
			[[330, 100, 0], [330, 100, 10], [330, 100, 20], [330, 100, 30], [330, 100, 40], [330, 100, 50], [330, 100, 60],
			 [330, 100, 70], [330, 100, 80], [330, 100, 90], [330, 100, 100]]]

		self.vars["list_faber_sl"] = [[[100, 0], [100, 50], [0, 0]],
					[[0, 0], [0, 75], [0, 100]],
					[[100, 0], [25, 75], [0, 100]],
					[[25, 0], [10, 50], [0, 75]],
					[[100, 0], [0, 0], [0, 100]],
					[[25, 0], [10, 50], [0, 75], [25, 75]], ]

		self.vars["enum_line"] = {
			"msoArrowheadNone": 1, "msoArrowheadTriangle": 2, "msoArrowheadOpen": 3, "msoArrowheadStealth": 4,
			"msoArrowheadDiamond": 5, "msoArrowheadOval": 6,
			"": 1, "<": 2, ">o": 3, ">>": 4, ">": 2, "<>": 5, "o": 6,
			"basic": 1, "none": 1, "triangle": 2, "open": 3, "stealth": 4, "diamond": 5, "oval": 6,
			"msoArrowheadNarrow": 1, "msoArrowheadWidthMedium": 2, "msoArrowheadWide": 3,
			"msoArrowheadShort": 1, "msoArrowheadLengthMedium": 2, "msoArrowheadLong": 3,
			"short": 1, "narrow": 1, "medium": 2, "long": 3, "wide": 3,
			"-1": 1, "0": 2, "1": 3,
			"dash": 4, "dashdot": 5, "dashdotdot": 6, "rounddot": 3, "longdash": 7, "longdashdot": 8,
			"longdashdotdot": 9,
			"squaredot": 2,
			"-": 4, "-.": 5, "-..": 6, ".": 3, "--": 7, "--.": 8, "--..": 9, "ㅁ": 2,
		}
		self.vars["base_cell_data"] = {
			"sheet_name": "",
			"xyxy": [100, 100, 0, 0],
			"color": 10058239,
			"line_style": "-.",
			"thickness": 0.5,
			"transparency": 0,
			"head_style": ">",
			"head_length": "0",
			"head_width": "0",
			"tail_style": ">",
			"tail_length": "0",
			"tail_width": "0",
		}

		self.vars["list_알파벳"] = "abcdefghijklmnopqrstuvwxyz"
		self.vars["list_자음"] = "ㄱㄴㄷㄹㅁㅂㅅㅇㅈㅊㅋㅌㅍㅎ"
		self.vars["list_모음"] ="ㅏㅑㅓㅕㅗㅛㅜㅠㅡㅣ"
		self.vars["list_가나다"] = "가나다라마바사아자차카타파하"
		self.vars["list_숫자"]= "1234567890"
		self.vars["list_그리스문자"]= "αβγδεζήθικλμνξόπρΣτ"
		self.vars["list_로마숫자"] = "ⅠⅡⅢⅣⅤⅥⅦⅧⅨⅩ"
		self.vars["list_원ㄱ"] = "㉠㉡㉢㉣㉤㉥㉦㉧㉨㉩㉪㉫㉬㉭"
		self.vars["list_원가"] = "㉮㉯㉰㉱㉲㉳㉴㉵㉶㉷㉸㉹㉺㉻"
		self.vars["list_원a"] = "ⒶⒷⒸⒹⒺⒻⒼⒽⒾⒿⓀⓁⓂⓃⓄⓅⓆⓇⓈⓉⓊⓋⓌⓍⓎⓏ"
		self.vars["list_원1"] ="⓪①②③④⑤⑥⑦⑧⑨⑩⑪⑫⑬⑭⑮⑯⑰⑱⑲⑳㉑㉒㉓㉔㉕㉖㉗㉘㉙㉚㉛㉜㉝㉞㉟㊱㊲㊳㊴㊵㊶㊷㊸㊹㊺㊻㊼㊽㊾㊿"
		self.vars["list_서수"] =['1ST', '2ND', '3RD', '4TH', '5TH', '6TH', '7TH', '8TH', '9TH', '10TH', '11TH', '12TH', '13TH', '14TH', '15TH', '16TH', '17TH', '18TH', '19TH', '20TH', '21ST', '22ND', '23RD', '24TH', '25TH', '26TH', '27TH', '28TH', '29TH', '30TH', '31ST']

		self.vars["list_month_eng_short"] = ['JAN', 'FEB', 'MAR', 'APR', 'MAY', 'JUN', 'JUL', 'AUG', 'SEP', 'OCT', 'NOV', 'DEC']
		self.vars["list_month_eng"] = ['JANUARY', 'FEBRUARY', 'MARCH', 'APRIL', 'MAY', 'JUNE', 'JULY', 'AUGUST', 'SEPTEMBER', 'OCTOBER', 'NOVEMBER', 'DECEMBER']
		self.vars["list_getdigit"] = ['one', 'two', 'three', 'four', 'five', 'six', 'seven', 'eight', 'nine']
		self.vars["list_num_eng_00digit"] = ['twenty', 'thirty', 'forty', 'fifty', 'sixty', 'seventy', 'eighty', 'ninety']
		self.vars["list_num_eng_10"] = ['ten', 'eleven', 'twelve', 'thirteen', 'fourteen', 'fifteen', 'sixteen', 'eighteen', 'nineteen']
		self.vars["list_num_eng_unit_1000"] = ['thousand', 'million', 'billion', 'trillion']
		self.vars["list_currency_eng_last"] = ['no', 'one', 'dollars']
		self.vars["list_num_last_cent"] = ['only', 'and one cent', 'and', 'cents']

		self.vars["keyboard_hex_code"] = {}
		self.vars["keyboard_hex_code"]["VK_LBUTTON"]  = [0x01, "마우스 왼쪽 버른"]
		self.vars["keyboard_hex_code"]["VK_RBUTTON"] = [0x02, "마우스 오른쪽 버튼"]
		self.vars["keyboard_hex_code"]["VK_CANCEL"] = [0x03, "Ctrl+Break"]
		self.vars["keyboard_hex_code"]["VK_MBUTTON"] = [0x04, "마우스 가운데 버튼"]
		self.vars["keyboard_hex_code"]["VK_XBUTTON1"] = [0x05, "X1 마우스 버튼"]
		self.vars["keyboard_hex_code"]["VK_XBUTTON2"] = [0x06, "X2 마우스 버튼"]
		self.vars["keyboard_hex_code"]["VK_BACK"] = [0x08, "Backspace"]
		self.vars["keyboard_hex_code"]["VK_TAB"] = [0x09, "Tab"]
		self.vars["keyboard_hex_code"]["VK_CLEAR"] = [0x0C, "Clear 키"]
		self.vars["keyboard_hex_code"]["VK_RETURN"] = [0x0D, "Enter"]
		self.vars["keyboard_hex_code"]["VK_SHIFT"] = [0x10, "Shift"]
		self.vars["keyboard_hex_code"]["VK_CONTROL"] = [0x11, "Ctrl"]
		self.vars["keyboard_hex_code"]["VK_MENU"] = [0x12, "Alt"]
		self.vars["keyboard_hex_code"]["VK_PAUSE"] = [0x13, "Pause"]
		self.vars["keyboard_hex_code"]["VK_CAPITAL"] = [0x14, "Caps Lock"]
		self.vars["keyboard_hex_code"]["VK_HANGUEL"] = [0x15, "IME 가나 모드 / 한글 모드"]
		self.vars["keyboard_hex_code"]["VK_KANA"] = [0x15, "IME 가나 모드 / 한글 모드"]
		self.vars["keyboard_hex_code"]["VK_JUNJA"] = [0x17, "IME 전자 모드"]
		self.vars["keyboard_hex_code"]["VK_FINAL"] = [0x18, "IME 최종 모드"]
		self.vars["keyboard_hex_code"]["VK_KANJI"] = [0x19, "IME 한자 모드"]
		self.vars["keyboard_hex_code"]["VK_HANJA"] = [0x19, "IME 한자 모드"]
		self.vars["keyboard_hex_code"]["VK_ESCAPE"] = [0x1B, "Esc"]
		self.vars["keyboard_hex_code"]["VK_CONVERT"] = [0x1C, "IME 변환"]
		self.vars["keyboard_hex_code"]["VK_NONCONVERT"] = [0x1D, "IME 변환 안함"]
		self.vars["keyboard_hex_code"]["VK_ACCEPT"] = [0x1E, "IME 승인"]
		self.vars["keyboard_hex_code"]["VK_MODECHANGE"] = [0x1F, "IME 모드 변경 요청"]
		self.vars["keyboard_hex_code"]["VK_SPACE"] = [0x20, "Space Bar"]
		self.vars["keyboard_hex_code"]["VK_PRIOR"] = [0x21, "Page Up"]
		self.vars["keyboard_hex_code"]["VK_NEXT"] = [0x22, "Page Down"]
		self.vars["keyboard_hex_code"]["VK_END"] = [0x23, "End"]
		self.vars["keyboard_hex_code"]["VK_HOME"] = [0x24, "Home"]
		self.vars["keyboard_hex_code"]["VK_LEFT"] = [0x25, "—"]
		self.vars["keyboard_hex_code"]["VK_UP"] = [0x26, "?"]
		self.vars["keyboard_hex_code"]["VK_RIGHT"] = [0x27, "-"]
		self.vars["keyboard_hex_code"]["VK_DOWN"] = [0x28, "1"]
		self.vars["keyboard_hex_code"]["VK_SELECT"] = [0x29, "Select"]
		self.vars["keyboard_hex_code"]["VK_PRINT"] = [0x2A, "Print"]
		self.vars["keyboard_hex_code"]["VK_EXECUTE"] = [0x2B, "Execute"]
		self.vars["keyboard_hex_code"]["VK_SNAPSHOT"] = [0x2C, "Print Screen"]
		self.vars["keyboard_hex_code"]["VK_INSERT"] = [0x2D, "Insert"]
		self.vars["keyboard_hex_code"]["VK_DELETE"] = [0x2E, "Delete"]
		self.vars["keyboard_hex_code"]["VK_HELP"] = [0x2F, "Help"]
		self.vars["keyboard_hex_code"]["VK_LWIN"] = [0x5B, "왼쪽 윈도우 키"]
		self.vars["keyboard_hex_code"]["VK_RWIN"] = [0x5C, "오른쪽 원도우 키"]
		self.vars["keyboard_hex_code"]["VK_APPS"] = [0x5D, "어플리케이션 키"]
		self.vars["keyboard_hex_code"]["VK_SLEEP"] = [0x5F, "Computer Sleep 키"]
		self.vars["keyboard_hex_code"]["VK_NUMPAD0"] = [0x60, "숫자 키패드 0"]
		self.vars["keyboard_hex_code"]["VK_NUMPAD1"] = [0x61, "숫자 키패드 1"]
		self.vars["keyboard_hex_code"]["VK_NUMPAD2"] = [0x62, "숫자 키패드 2"]
		self.vars["keyboard_hex_code"]["VK_NUMPAD3"] = [0x63, "숫자 키패드 3"]
		self.vars["keyboard_hex_code"]["VK_NUMPAD4"] = [0x64, "숫자 키패드 4"]
		self.vars["keyboard_hex_code"]["VK_NUMPAD5"] = [0x65, "숫자 키패드 5"]
		self.vars["keyboard_hex_code"]["VK_NUMPAD6"] = [0x66, "숫자 키패드 6"]
		self.vars["keyboard_hex_code"]["VK_NUMPAD7"] = [0x67, "숫자 키패드 7"]
		self.vars["keyboard_hex_code"]["VK_NUMPAD8"] = [0x68, "숫자 키패드 8"]
		self.vars["keyboard_hex_code"]["VK_NUMPAD9"] = [0x69, "숫자 키패드 9"]
		self.vars["keyboard_hex_code"]["VK_MULTIPLY"] = [0x6A, "숫자 키패드 *"]
		self.vars["keyboard_hex_code"]["VK_ADD"] = [0x6B, "숫자 키패드+"]
		self.vars["keyboard_hex_code"]["VK_SEPARATOR"] = [0x6C, "Separator 키"]
		self.vars["keyboard_hex_code"]["VK_SUBTRACT"] = [0x6D, "숫자 키패드-"]
		self.vars["keyboard_hex_code"]["VK_DECIMAL"] = [0x6E, "숫자 키패드."]
		self.vars["keyboard_hex_code"]["VK_DEVIDE"] = [0x6F, "숫자 키패드/"]
		self.vars["keyboard_hex_code"]["VK_F1"] = [0x70, "F1"]
		self.vars["keyboard_hex_code"]["VK_F2"] = [0x71, "F2"]
		self.vars["keyboard_hex_code"]["VK_F3"] = [0x72, "F3"]
		self.vars["keyboard_hex_code"]["VK_F4"] = [0x73, "F4"]
		self.vars["keyboard_hex_code"]["VK_F5"] = [0x74, "F5"]
		self.vars["keyboard_hex_code"]["VK_F6"] = [0x75, "F6"]
		self.vars["keyboard_hex_code"]["VK_F7"] = [0x76, "F7"]
		self.vars["keyboard_hex_code"]["VK_F8"] = [0x77, "F8"]
		self.vars["keyboard_hex_code"]["VK_F9"] = [0x78, "F9"]
		self.vars["keyboard_hex_code"]["VK_F10"] = [0x79, "F10"]
		self.vars["keyboard_hex_code"]["VK_F11"] = [0x7A, "F11"]
		self.vars["keyboard_hex_code"]["VK_F12"] = [0x7B, "F12"]
		self.vars["keyboard_hex_code"]["VK_F13"] = [0x7C, "F13"]
		self.vars["keyboard_hex_code"]["VK_F14"] = [0x7D, "F14"]
		self.vars["keyboard_hex_code"]["VK_F15"] = [0x7E, "F15"]
		self.vars["keyboard_hex_code"]["VK_F16"] = [0x7F, "F16"]
		self.vars["keyboard_hex_code"]["VK_F17"] = [0x80, "F17"]
		self.vars["keyboard_hex_code"]["VK_F18"] = [0x81, "F18"]
		self.vars["keyboard_hex_code"]["VK_F19"] = [0x82, "F19"]
		self.vars["keyboard_hex_code"]["VK_F20"] = [0x83, "F20"]
		self.vars["keyboard_hex_code"]["VK_F21"] = [0x84, "F21"]
		self.vars["keyboard_hex_code"]["VK_F22"] = [0x85, "F22"]
		self.vars["keyboard_hex_code"]["VK_F23"] = [0x86, "F23"]
		self.vars["keyboard_hex_code"]["VK_F24"] = [0x87, "F24"]
		self.vars["keyboard_hex_code"]["VK_NUMLOCK"] = [0x90, "Num Lock"]
		self.vars["keyboard_hex_code"]["VK_SCROLL"] = [0x91, "Scroll Lock"]
		self.vars["keyboard_hex_code"]["VK_LSHIFT"] = [0xA0, "왼쪽 Shift"]
		self.vars["keyboard_hex_code"]["VK_RSHIFT"] = [0xA1, "오른쪽 Shift"]
		self.vars["keyboard_hex_code"]["VK_LCONTROL"] = [0xA2, "왼쪽 Ctrl"]
		self.vars["keyboard_hex_code"]["VK_RCONTROL"] = [0xA3, "오른쪽 Ctrl"]
		self.vars["keyboard_hex_code"]["VK_LMENU"] = [0xA4, "왼쪽 Alt"]
		self.vars["keyboard_hex_code"]["VK_RMENU"] = [0xA5, "오른쪽 Alt"]


		self.vars["first_letter"] = ["ㄱ", "ㄲ", "ㄴ", "ㄷ", "ㄸ", "ㄹ", "ㅁ", "ㅂ", "ㅃ", "ㅅ",
		                             "ㅆ", "ㅇ", "ㅈ", "ㅉ", "ㅊ", "ㅋ", "ㅌ", "ㅍ", "ㅎ"]  # 19 글자
		self.vars["second_letter"] = ["ㅏ", "ㅐ", "ㅑ", "ㅒ", "ㅓ", "ㅔ", "ㅕ", "ㅖ",
		                              "ㅗ", "ㅘ", "ㅙ", "ㅚ", "ㅛ", "ㅜ", "ㅝ", "ㅞ",
		                              "ㅟ", "ㅠ", "ㅡ", "ㅢ", "ㅣ"]  # 21 글자
		self.vars["third_letter"] = ["", "ㄱ", "ㄲ", "ㄳ", "ㄴ", "ㄵ", "ㄶ", "ㄷ",
		                             "ㄹ", "ㄺ", "ㄻ", "ㄼ", "ㄽ", "ㄾ", "ㄿ", "ㅀ",
		                             "ㅁ", "ㅂ", "ㅄ", "ㅅ", "ㅆ", "ㅇ", "ㅈ", "ㅊ",
		                             "ㅋ", "ㅌ", "ㅍ", "ㅎ"]  # 28 글자, 없는것 포함

		self.vars["first_letter_no"] = {"ㄱ":0, "ㄲ":1, "ㄴ":2, "ㄷ":3, "ㄸ":4, "ㄹ":5, "ㅁ":6, "ㅂ":7, "ㅃ":8, "ㅅ":9,
		                             "ㅆ":10, "ㅇ":11, "ㅈ":12, "ㅉ":13, "ㅊ":14, "ㅋ":15, "ㅌ":16, "ㅍ":17, "ㅎ":18}  # 19 글자
		self.vars["second_letter_no"] = {"ㅏ":0, "ㅐ":1, "ㅑ":2, "ㅒ":3, "ㅓ":4, "ㅔ":5, "ㅕ":6, "ㅖ":7,
		                              "ㅗ":8, "ㅘ":9, "ㅙ":10, "ㅚ":11, "ㅛ":12, "ㅜ":13, "ㅝ":14, "ㅞ":15,
		                              "ㅟ":16, "ㅠ":17, "ㅡ":18, "ㅢ":19, "ㅣ":20}  # 21 글자
		self.vars["third_letter_no"] = {"":0, "ㄱ":1, "ㄲ":2, "ㄳ":3, "ㄴ":4, "ㄵ":5, "ㄶ":6, "ㄷ":7,
		                             "ㄹ":8, "ㄺ":9, "ㄻ":10, "ㄼ":11, "ㄽ":12, "ㄾ":13, "ㄿ":14, "ㅀ":15,
		                             "ㅁ":16, "ㅂ":17, "ㅄ":18, "ㅅ":19, "ㅆ":20, "ㅇ":21, "ㅈ":22, "ㅊ":23,
		                             "ㅋ":24, "ㅌ":25, "ㅍ":26, "ㅎ":27}  # 28 글자, 없는것 포함


		self.vars["jamo_vs_eng"] = {
			"ㄱ" : "a", "ㄲ" : "aa", "ㄴ" : "b", "ㄷ" : "c", "ㄸ" : "cc",
			"ㄹ" : "d", "ㅁ" : "e", "ㅂ" : "f", "ㅃ" : "ff",
			"ㅅ" : "g", "ㅆ" : "gg", "ㅇ" : "h", "ㅈ" : "i",
			"ㅉ" : "ii", "ㅊ" : "j", "ㅋ" : "k", "ㅌ" : "l", "ㅍ" : "m", "ㅎ":"n",

			"ㄳ" : "ag", "ㄵ" : "bi", "ㄶ" : "bn", "ㄺ" : "da",
			"ㄻ" : "de", "ㄼ" : "df", "ㄽ" : "dg", "ㄾ" : "dl",
			"ㄿ" : "dm", "ㅀ" : "dn", "ㅄ" : "fg",


			"ㅏ" : "o", "ㅐ" : "ox", "ㅑ" : "p", "ㅒ" : "px", "ㅓ" : "q",
			"ㅔ" : "gx", "ㅕ" : "r", "ㅖ" : "rx", "ㅗ" : "s", "ㅘ" : "so",
			"ㅙ" : "sox", "ㅚ" : "sx", "ㅛ" : "t", "ㅜ" : "u", "ㅝ" : "ug",
			"ㅞ" : "ugx", "ㅟ" : "ux", "ㅠ" : "v", "ㅡ" : "w", "ㅢ" : "wx", "ㅣ":"x",

			"" : "", "_" : "z",
			}

		self.vars["eng_vs_jamo"] = {
			'a': 'ㄱ', 'aa': 'ㄲ', 'b': 'ㄴ', 'c': 'ㄷ', 'cc': 'ㄸ', 'd': 'ㄹ',
			'e': 'ㅁ', 'f': 'ㅂ', 'ff': 'ㅃ', 'g': 'ㅅ', 'gg': 'ㅆ', 'h': 'ㅇ',
			'i': 'ㅈ', 'ii': 'ㅉ', 'j': 'ㅊ', 'k': 'ㅋ', 'l': 'ㅌ', 'm': 'ㅍ',
			'n': 'ㅎ', 'ag': 'ㄳ', 'bi': 'ㄵ', 'bn': 'ㄶ', 'da': 'ㄺ', 'de': 'ㄻ',
			'df': 'ㄼ', 'dg': 'ㄽ', 'dl': 'ㄾ', 'dm': 'ㄿ', 'dn': 'ㅀ', 'fg': 'ㅄ',
			'o': 'ㅏ', 'ox': 'ㅐ', 'p': 'ㅑ', 'px': 'ㅒ', 'q': 'ㅓ', 'gx': 'ㅔ',
			'r': 'ㅕ', 'rx': 'ㅖ', 's': 'ㅗ', 'so': 'ㅘ', 'sox': 'ㅙ', 'sx': 'ㅚ',
			't': 'ㅛ', 'u': 'ㅜ', 'ug': 'ㅝ', 'ugx': 'ㅞ', 'ux': 'ㅟ', 'v': 'ㅠ',
			'w': 'ㅡ', 'wx': 'ㅢ', 'x': 'ㅣ', '': '', 'z': '_'}

		self.vars["eng_vs_jamo_list"] = [
			[['sox', 'ㅙ'], ['ugx', 'ㅞ'],],
			[['ox', 'ㅐ'], ['px', 'ㅒ'], ['gx', 'ㅔ'], ['rx', 'ㅖ'], ['so', 'ㅘ'], ['sx', 'ㅚ'], ['wx', 'ㅢ'], ['ug', 'ㅝ'], ['ux', 'ㅟ'],],
			[['a', 'ㄱ'],['b', 'ㄴ'],['c', 'ㄷ'], ['d', 'ㄹ'], ['e', 'ㅁ'], ['f', 'ㅂ'], ['g', 'ㅅ'], ['h', 'ㅇ'], ['i', 'ㅈ'], ['j', 'ㅊ'], ['k', 'ㅋ'], ['l', 'ㅌ'], ['m', 'ㅍ'], ['n', 'ㅎ']],
			[['aa', 'ㄲ'], ['cc', 'ㄸ'],['ff', 'ㅃ'], ['gg', 'ㅆ'], ['ii', 'ㅉ'], ['ag', 'ㄳ'], ['bi', 'ㄵ'], ['bn', 'ㄶ'], ['da', 'ㄺ'], ['de', 'ㄻ'], ['df', 'ㄼ'], ['dg', 'ㄽ'], ['dl', 'ㄾ'], ['dm', 'ㄿ'], ['dn', 'ㅀ'], ['fg', 'ㅄ'],],
			[['o', 'ㅏ'], ['p', 'ㅑ'], ['q', 'ㅓ'], ['r', 'ㅕ'], ['s', 'ㅗ'], ['t', 'ㅛ'], ['u', 'ㅜ'], ['v', 'ㅠ'], ['w', 'ㅡ'], ['x', 'ㅣ'],],
		    [['z', '_']],
			]

		self.vars["mon_eng_vs_no"] = {"JAN":1, "FEB":2, "MAR":3, "APR":4, "MAY":5, "JUN":6,
		                              "JUL":7, "AUG":8, "SEP":9, "OCT":10, "NOV":11, "DEC":12,
		                              "JANUARY":1, "FEBRUARY":2, "MARCH":3, "APRIL":4, "JUNE":6,
		                              "JULY":7, "AUGUST":8,"SEPTEMBER":9, "OCTOBER":10, "NOVEMBER":11, "DECEMBER":12}


		self.vars["jfinder_gui_dic_1"] = {"탐색방법 => 최소탐색": [1, '(최소찾기)'], "탐색방법 => 최대탐색": [1, "(최대찾기)"],
		              "컴파일 방법 => 대소문자무시": [1, "(대소문자무시)"],
		              "컴파일 방법 => 개행문자포함": [1, "(개행문자포함)"],
		              "컴파일 방법 => 여러줄로표현": [1, "(여러줄로표현)"],
		              }
		self.vars["jfinder_gui_dic_2"] = {
			"문장 맨처음부터 맞아야함": [2, '[처음]', "type_20"],
			"맨끝에 맞아야함": [2, '[맨끝]', "type_20"],
			"한글": [2, '한글&', "type_21"],
			"한글모음": [2, '한글모음&', "type_21"],
			"한글자음": [2, '한글자음&', "type_21"],
			"영어": [2, "영어&", "type_21"],
			"한자": [2, "한자&", "type_21"],
			"일어": [2, "일본어&", "type_21"],
			"공백(공백, 탭 등)": [2, "공백&", "type_21"],
			"숫자": [2, "숫자&", "type_21"],
			"제외, not(포함하지 않음)": [2, "^", "type_22"],
			"문자1개": [2, "[문자]", "type_23"],
			"연속된 2~5까지의 숫자": [2, "[2-5", "type_24"],
			"연속된 c~e까지의 문자": [2, "[c-e", "type_24"],
			"j 또는 f 또는 i가 들어간 문자": [2, "[jfi", "type_24"],
			"abc가 단어가 들어간 문자": [2, "[(abc)", "type_24"],
			"특정단어": [2, "[(특정단어)", "type_24"],
			"메타문자": [2, "[\메타문자", "type_24"],
			"특수문자": [2, '[특수문자', "type_24"],
			"특정단어제외": [2, '[^(제외할단어)', "type_24"],
			"또는": [2, '|', "type_25"],
			}

		self.vars["jfinder_gui_dic_3"] = {"1개": [3, ":1~1]", "type_x0"],
		              "1개이상": [3, ":1~]", "type_x0"],
		              "1~10개사이": [3, ":1~10]", "type_x0"],
		              "0개이상": [3, ":0~]", "type_x0"],
		              "0개또는1개": [3, ":0~1]", "type_x0"],
		              "n개~m개": [3, ":n~m]", "type_x0"],
		              }
		self.vars["jfinder_gui_dic_4"] = {"abc중 c만 1번이상 반복되는것 찾기": [4, "abc[1~]", "type_z0"],
		              "abc중 bc만 1번이상 반복되는것 찾기": [4, "a(bc)[1~]", "type_z0"],
		              "a와 b와 c를 제외한 모든 문자와 매치": [4, "[^abc]", "type_z0"],
		              "한글로 3~5개의 글자로 된것을 그룹명 짖기": [4, "(?P<그룹명>[한글:3~5])", "type_z0"],
		              "a와 b사이의 모든문자 찾기": [4, "a[문자:1~]b", "type_z0"],
		              "a또는b또는c": [4, "a[또는]b[또는]c", "type_z0"],
		              "전방탐색 : .+(?=:) => :앞의 모든 문자": [4, ".+(?=:)", "type_z0"],
		              "후방탐색 : (?<=\$)[0-9.]+ => $뒤의 숫자": [4, "(?<=\$)[0-9.]+", "type_z0"],
		              "Html태그중 <H숫자>찾을문자<\H숫자>안의 글자": [4, "<H(0-30])>.*?</H\\1>", "type_z0"],
		              "문장중 핸드폰번호 찾기": [4, "0[1~1][숫자:2~2]-[0~1][숫자:3~4]-[0~1][숫자:4~4]", "type_z0"],
		              "2022-01-01형식의 날짜찾기": [4, "[0-9]{4})-([0-9]{2})-([0-9]{2}", "type_z0"],
		              "이메일찾기": [4, "[\w\.-]+@[\w\.-]+", "type_z0"],
		              "괄호안의 숫자 찾기": [4, "([모든문자:0~])", "type_z0"],
		              "지역 전화번호 찾기": [4, "0(2|31|32|33|41|42|43|44|51|52|53|54|55|61|62|63|64)\-{0,1}\d{3,4}\-{0,1}\d{4}",
		                             "type_z0"],
		              "주민등록번호": [4, "[0-9]{2}0[1-9]|1[0-2]0[1-9]|[1,2][0-9]|3[0,1]-[1-4][0-9]{6}", "type_z0"],
		              "금액": [4, "[숫자,][1~][원:0~1]", "type_z0"],
		              "중복된 단어 찾기": [4, "\\b(\\w+)\\s+\\1\\b", "type_z0"],
		              }





























class basic_cell_class():
	# 각 셀에대해서 어떤 자료들을 넣을수있을지 설정하도록 만든 것이다
	# 다음에 추가적인것들도 가능하도록 클래스로 만든 것이다
	def __init__(self):
		self.values = {
			"font_dic": {"font_color": None, "font_size": None, "background": None, "bold": None, "color": None, "colorindex": None, "creator": None, "style": None, "italic": None,
				"name": None, "size": None, "strikethrough": None, "subscript": None, "superscript": None, "themecolor": None, "themefont": None, "tintandshade": None, "underline": None},
			"line_top_dic": {"do": None, "color": None, "colorindex": None, "tintandshade": None, "thick": None, "style": None, "brush": None, },
			"line_bottom_dic": {"do": None, "color": None, "colorindex": None, "tintandshade": None, "thick": None, "style": None, "brush": None, },
			"line_left_dic": {"do": None, "color": None, "colorindex": None, "tintandshade": None, "thick": None, "style": None, "brush": None, },
			"line_right_dic": {"do": None, "color": None, "colorindex": None, "tintandshade": None, "thick": None, "style": None, "brush": None, },
			"line_x1_dic": {"do": None, "color": None, "colorindex": None, "tintandshade": None, "thick": None, "style": None, "brush": None, },
			"line_x2_dic": {"do": None, "color": None, "colorindex": None, "tintandshade": None, "thick": None, "style": None, "brush": None, },
			"widget_dic": {"value": None, },
			"kind_dic": {"big": None, "middle": None, },
			"memo_dic": {"value": None},
			"checked": None,
			"fun": None,
			"kind_1": None,
			"kind_2": None,
			"user_type": None,
			"text": None,
			"text_kind": None,
			"value": None,
			"value2": None,
			"formularr1c1": None,
			"formular": None,
			"background_color": None,
			"background_colorindex": None,
			"numberformat": None,
			"widget": None,
			"align": None,
			"decoration": None,
			"edit": None,
			"access_text": None,
			"access": None,
			"order": None,
			"size": None,
			"check": None,
			"color": None,
			"function": None,
			"icon": None,
			"memo": None,
			"draw_line": None,
			"protect": None,
			"status": None,
			"what": None,
			"setup": None,
			"tool_tip": None,
			"etc": None,
			"user_1": None,
			"user_2": None,
			"user_3": None,
			"x": None,
			"y": None,
		}

class test_data:
	"""
	가끔 코딩을 해보니, 테스트용데이터가 필요하더라구요
	입력형태 :
	출력형태 :
	"""
	test_datas ={}
	test_datas["testdata_df_data"] = {"1번째열": {'Country': 'Russia', 'Capital': 'Moscow', 'Area(Sq.Miles)': 6601670, 'Population': 146171015},
		 "2번째열": {'Country': 'Canada', 'Capital': 'Ottawa', 'Area(Sq.Miles)': 3855100, 'Population': 38048738},
		 "3번째열": {'Country': 'China', 'Capital': 'Beijing', 'Area(Sq.Miles)': 3705407, 'Population': 1400050000},
		 "4번째열": {'Country': 'United States of America', 'Capital': 'Washington, D.C.', 'Area(Sq.Miles)': 3796742, 'Population': 331449281},
		 "5번째열": {'Country': 'Brazil', 'Capital': 'Brasília', 'Area(Sq.Miles)': 3287956, 'Population': 210147125},
		 "6번째열": {'Country': 'Russia', 'Capital': 'Moscow', 'Area(Sq.Miles)': 6601670, 'Population': 146171015},
		 "7번째열": {'Country': 'Canada', 'Capital': 'Ottawa', 'Area(Sq.Miles)': 3855100, 'Population': 38048738},
		 "8번째열": {'Country': 'China', 'Capital': 'Beijing', 'Area(Sq.Miles)': 3705407, 'Population': 1400050000},
		 "9번째열": {'Country': 'United States of America', 'Capital': 'Washington, D.C.', 'Area(Sq.Miles)': 3796742, 'Population': 331449281},
		 "10번째열": {'Country': 'Brazil', 'Capital': 'Brasília', 'Area(Sq.Miles)': 3287956, 'Population': 210147125}
				   }

	test_datas["testdata_df_2"] ={
		 "1번째열": {'A1': '러시아', 'Capital': 'Moscow', '면적': 6601670, '인구': 146171015},
		 "2번째열": {'A1': '카나다', 'Capital': 'Ottawa', '면적': 3855100, '인구': 38048738},
		 "3번째열": {'A1': '중국', 'Capital': 'Beijing', '면적': 3705407, '인구': 1400050000},
		 "4번째열": {'A1': '미국', 'Capital': 'Washington', '면적': 3796742, '인구': 331449281},
		 "5번째열": {'A1': '브라질', 'Capital': 'Brasília', '면적': 3287956, '인구': 210147125},
		 "6번째열": {'A1': '러시아', 'Capital': 'Moscow', '면적': 6601670, '인구': 146171015},
		 "7번째열": {'A1': '카나다', 'Capital': 'Ottawa', '면적': 3855100, '인구': 38048738},
		 "8번째열": {'A1': '중국', 'Capital': 'Beijing', '면적': 3705407, '인구': 1400050000},
		 "9번째열": {'A1': '미국', 'Capital': 'Washington', '면적': 3796742, '인구': 331449281},
		 "10번째열": {'A1': '브라질', 'Capital': 'Brasília', '면적': 3287956, '인구': 210147125}
				   }

	def sample_1(self):
		result = []
		for x in range(0, 20):
			for y in range(0, 50):
				temp = {"x": x, "y": y, "text": str(str(x) + "-" + str(y))}
				result.append(temp)
		return result


	test_datas["sample_2"] = [{"x": 2, "y": 1, "kind_1": "basic", "kind_2": "date", "value": datetime.datetime(2002, 2, 2)},
					{"x": 2, "y": 3, "kind_1": "basic", "kind_2": "basic", "text": "값"},
					{"x": 2, "y": 5, "kind_1": "basic", "kind_2": "basic", "text": "값"},
					{"x": 2, "y": 7, "kind_1": "basic", "kind_2": "date", "value": datetime.datetime(2002, 2, 2)},
					{"x": 2, "y": 6, "kind_1": "tool_tip", "text": "tool_tip", "tool_tip": "툴팁입니다"},
					{"x": 5, "y": 3, "kind_1": "widget", "kind_2": "combo", "value": [1, 2, 3, 4, 5]},
					{"x": 5, "y": 5, "kind_1": "widget", "kind_2": "check_box", "checked": 1, "text": "check"},
					{"x": 5, "y": 7, "kind_1": "widget", "kind_2": "progress_bar", "value": 30},
					{"x": 5, "y": 8, "kind_1": "widget", "kind_2": "button", "caption": "button_1", "action": "action_def"},
					{"x": 10, "y": 10, "kind_1": "memo", "value": "memo memo"},
					{"x": 2, "y": 2, "kind_1": "memo", "value": "memo memo"},
					{"x": 7, "y": 3, "kind_1": "font_color", "value": [255, 63, 24]},
					{"x": 7, "y": 5, "kind_1": "background_color", "value": [255, 63, 24]}, ]

	test_datas["sample_3"] = {
			1: [0, 0, 0], 2: [255, 255, 255], 3: [255, 0, 0], 4: [0, 255, 0], 5: [0, 0, 255],
			6: [255, 255, 0], 7: [255, 0, 255], 8: [0, 255, 255], 9: [128, 0, 0], 10: [0, 128, 0],
			11: [0, 0, 128], 12: [128, 128, 0], 13: [128, 0, 128], 14: [0, 128, 128], 15: [192, 192, 192],
			16: [128, 128, 128], 17: [153, 153, 255], 18: [153, 51, 102], 19: [255, 255, 204], 20: [204, 255, 255],
			21: [102, 0, 102], 22: [255, 128, 128], 23: [0, 102, 204], 24: [204, 204, 255], 25: [0, 0, 128],
			26: [255, 0, 255], 27: [255, 255, 0], 28: [0, 255, 255], 29: [128, 0, 128], 30: [128, 0, 0],
			31: [0, 128, 128], 32: [0, 0, 255], 33: [0, 204, 255], 34: [204, 255, 255], 35: [204, 255, 204],
			36: [255, 255, 153], 37: [153, 204, 255], 38: [255, 153, 204], 39: [204, 153, 255], 40: [255, 204, 153],
			41: [51, 102, 255], 42: [51, 204, 204], 43: [153, 204, 0], 44: [255, 204, 0], 45: [255, 153, 0],
			46: [255, 102, 0], 47: [102, 102, 153], 48: [150, 150, 150], 49: [0, 51, 102], 50: [51, 153, 102],
			51: [0, 51, 0], 52: [51, 51, 0], 53: [153, 51, 0], 54: [153, 51, 102], 55: [51, 51, 153],
			56: [51, 51, 51], }

	def pandas_1(self):
		"""
		가끔 코딩을 해보니, 테스트용데이터가 필요하더라구요
		입력형태 :
		출력형태 :
		"""
		dic_data = {
			"1번째열": {'Country': 'Russia', 'Capital': 'Moscow', 'Area(Sq.Miles)': 6601670, 'Population': 146171015},
			"2번째열": {'Country': 'Canada', 'Capital': 'Ottawa', 'Area(Sq.Miles)': 3855100, 'Population': 38048738},
			"3번째열": {'Country': 'China', 'Capital': 'Beijing', 'Area(Sq.Miles)': 3705407, 'Population': 1400050000},
			"4번째열": {'Country': 'United States of America', 'Capital': 'Washington, D.C.',
			         'Area(Sq.Miles)': 3796742, 'Population': 331449281},
			"5번째열": {'Country': 'Brazil', 'Capital': 'Brasília', 'Area(Sq.Miles)': 3287956,
			         'Population': 210147125},
			"6번째열": {'Country': 'Russia', 'Capital': 'Moscow', 'Area(Sq.Miles)': 6601670, 'Population': 146171015},
			"7번째열": {'Country': 'Canada', 'Capital': 'Ottawa', 'Area(Sq.Miles)': 3855100, 'Population': 38048738},
			"8번째열": {'Country': 'China', 'Capital': 'Beijing', 'Area(Sq.Miles)': 3705407, 'Population': 1400050000},
			"9번째열": {'Country': 'United States of America', 'Capital': 'Washington, D.C.',
			         'Area(Sq.Miles)': 3796742, 'Population': 331449281},
			"10번째열": {'Country': 'Brazil', 'Capital': 'Brasília', 'Area(Sq.Miles)': 3287956,
			          'Population': 210147125}
			}
		return dic_data

	def pandas_2(self):
		"""
		가끔 코딩을 해보니, 테스트용데이터가 필요하더라구요
		간단하게 바꿔봄
		입력형태 :
		출력형태 :
		"""
		dic_data = {
			"1번째열": {'A1': '러시아', 'Capital': 'Moscow', '면적': 6601670, '인구': 146171015},
			"2번째열": {'A1': '카나다', 'Capital': 'Ottawa', '면적': 3855100, '인구': 38048738},
			"3번째열": {'A1': '중국', 'Capital': 'Beijing', '면적': 3705407, '인구': 1400050000},
			"4번째열": {'A1': '미국', 'Capital': 'Washington', '면적': 3796742, '인구': 331449281},
			"5번째열": {'A1': '브라질', 'Capital': 'Brasília', '면적': 3287956, '인구': 210147125},
			"6번째열": {'A1': '러시아', 'Capital': 'Moscow', '면적': 6601670, '인구': 146171015},
			"7번째열": {'A1': '카나다', 'Capital': 'Ottawa', '면적': 3855100, '인구': 38048738},
			"8번째열": {'A1': '중국', 'Capital': 'Beijing', '면적': 3705407, '인구': 1400050000},
			"9번째열": {'A1': '미국', 'Capital': 'Washington', '면적': 3796742, '인구': 331449281},
			"10번째열": {'A1': '브라질', 'Capital': 'Brasília', '면적': 3287956, '인구': 210147125}
		}
		return dic_data




	test_datas["sample_4"] = [
			"20230301",
			'02/28/2023 02:30 PM',
			'180919 015519',
			'18/09/19 01:55:19',
			'2019-02-02 15:56:15.197103-05:00',
			'2018-06-29 08:15:27.243860',
			'2018-03-12T10:12:45Z',
			'2018-03-12',
			'2018-06-29 17:08:00.586525+00:00',
			'2018-06-29 17:08:00.586525+05:00',
			'Jun 28 2018 7:40AM',
			'Jun 28 2018 at 7:40AM',
			'September 18, 2017, 22:19:55',
			'Sun, 05/12/1999, 12:30PM',
			'Mon, 21 March, 2015',
			'Tuesday , 6th September, 2017 at 4:30pm'
			]


	test_datas["machine_names"] = ['fitting', 'ball', 'flowmeter', 'on-off', 'battery', 'flange', 'electric', 'cable', 'gasket',
	                 'seal',
	                 'invertor', 'plate', 'level', 'gauge', 'gas', 'meter', 'centrifugal', 'magnetic', 'psv',
	                 'titanium',
	                 'pressure', 'motor', 'boiler', 'globe', 'gate', 'transformer', 'charger', 'blower', 'inverter',
	                 'orifice', 'ph', 'ebd', 'mass', 'plug', 'diaphragm', 'dcs', 'detector', 'heater', 'hv', 'scale',
	                 'instrument', 'ups', 'pg', 'reactor', 'compressor', 'vessel', 'butterfly', 'mechanical', 'element',
	                 'tube', 'bellows', 'mixer', 'agitator', 'hose', 'diaphgram', 'separator', 'mcc', 'plc', 'frp',
	                 'cooler', 'rubber', 'ngr', 'bolt', 'nut', 'rtd', 'bolt/nut', 'graphite', 'drum', 'relay', 'LV',
	                 'palstic', 'rotary', 'sensor', 'microwave', 'column', 'screen', 'manual', 'balance', 'bundle',
	                 'plastivc', 'acb', 'carbon', 'change', 'cell', 'strainer', 'type', 'cover', 'tg', 'membrane',
	                 'prv',
	                 'ptfe', 'check', 'nickel', 'analyzer', 'oil', 'water', 'temperature', 'glove', 'channel', 'ring',
	                 'etfe', 'sheet', 'tms', 'scrubber', 'lift', 'oven', 'holder', 'container', 'cctv', 'vcb',
	                 'condensor',
	                 'casting', 'metal', 'rupture', 'disc', 'gear', 'screw', 'leak', '3-way', 'canned', 'package',
	                 'dryer',
	                 'feeder', '양극전극', 'bag', 'air', '농도계', 'pin', 'impeller', 'metering', 'kit', 'actuator', 'aircon',
	                 'column', 'compressor', 'concentration', 'condenser', 'conductivity', 'connector', 'contcnrator',
	                 'contol', 'control', 'control ball valve', 'control-valve', 'convection', 'conveyor', 'cooler',
	                 'cover', 'crusher', 'cryogel', 'cw', 'cyclone', 'cylinder', 'd/p']

	test_datas["changed_dic"] = {"밸브": "valve", "교반기": "agitator",
	               "아지테이터": "agitator",
	               "송풍기": "blower",
	               "블로어": "blower",
	               "s/p": "spare part",
	               "케이블": "cable",
	               "스페어파트": "spare part",
	               "컨트롤밸브": "control valve",
	               "컨트롤벨브": "control valve",
	               "컨테이너": "container",
	               "정화관": "",
	               "배터리": "battery",
	               "차저": "charger",
	               "액츄에이터": "actuator",
	               "토너공장": "",
	               "환경운영": "",
	               "다이아프램": "diaphgram",
	               "압축기": "compressor",
	               "컨트롤valve": "control valve",
	               "볼valve": "ball valve",
	               "그린소재": "",
	               "메셀로스": "",
	               "신설": "",
	               "개선": "",
	               "완제품": "",
	               "호이스트": "hoist",
	               "확보용": "",
	               "보수재": "",
	               "작업용": "",
	               "시운전": "",
	               "노후장치교체": "",
	               "환경설비": "",
	               "변경": "",
	               "기존품": "",
	               "교체관련": "",
	               "교쳬": "",
	               "호환": "",
	               "판넬": "panel",
	               "배관재": "piping",
	               "파이프": "pipe",
	               "펌프": "pump",
	               "배관담당": "",
	               "보수용": "",
	               "보일러": "boiler",
	               "자동화": "",
	               "변압기": "transformer",
	               "티타늄": "titanium",
	               "라인드": "linned",
	               "탱크": "tank",
	               "피팅류": "fitting",
	               "컨트롤": "control",
	               "글로브": "globe",
	               "열교환기": "heat exchanger",
	               "인버터판넬": "invertor panel",
	               "스위치": "switch",
	               "산소농도측정기": "o2 analyzer",
	               "수분분석기": "h20 analyzer",
	               "분석기": "analyzer",
	               "인버터": "invertor",
	               "가구": "",
	               "가성소다": "",
	               "가스감지기": "gas detector",
	               "가스검지기": "gas detector",
	               "가스켓": "gasket",
	               "가스탐지기": "gas detector",
	               "감지": "",
	               "검사장비": "",
	               "경고표지": "",
	               "계단": "",
	               "교체": "",
	               "구공장": "",
	               "구동부": "",
	               "구매": "",
	               "구매요청건": "",
	               "구축": "",
	               "구축용": "",
	               "기계담당": "",
	               "기업용": "",
	               "기존": "",
	               "기초물성": "",
	               "냉매합리화": "",
	               "노후": "",
	               "노후panel": "",
	               "단관": "",
	               "담당": "",
	               "등": "",
	               "等": "",
	               "마곡연구소": "",
	               "메인": "",
	               "목": "",
	               "및": "",
	               "보수": "",
	               "보완": "",
	               "부속10종": "",
	               "비용정산": "",
	               "상부": "",
	               "선입고": "",
	               "설치": "",
	               "순환": "",
	               "순환식": "",
	               "스티커": "",
	               "신규": "",
	               "신규제작": "",
	               "연구1팀": "",
	               "연구부문": "",
	               "연구소": "",
	               "이동": "",
	               "이물": "",
	               "이송": "",
	               "일반": "",
	               "일반형": "",
	               "전해c": "",
	               "전해c공장": "",
	               "전해공장용": "",
	               "주요": "",
	               "철거": "",
	               "추가": "",
	               "추가부품": "",
	               "추가정산": "",
	               "투자": "",
	               "투자관련": "",
	               "포함": "",
	               "한국요꼬가와전기": "",
	               "한중유화": "",
	               "합리화": "",
	               "합성공정": "",
	               "협력사": "",
	               }

	test_datas["base_2dlist_for_change"] = [
		["드럼", " drum "],
		["펄프밀", " pulp mill "],
		["슬러리", " slury "],
		["펄프분쇄기", " pulp mill "],
		["엘레먼트", " element "],
		["가스캐비넷", " gas cabinet "],
		["공기 compressor", " air compressor "],

		["고압", " high voltage "],
		["건조기", " dryer "],
		["믹서", " mixer "],
		["가스감지기", " gas detector "],
		["가스검지기", " gas detector "],
		["가스탐지기", " gas detector "],
		["게이트", " gate "],
		["v/v", " valve "],
		["on-off", " on/off "],
		["on off", " on/off "],
		["s/p", " spare parts "],
		["컴프레서", " compressor "],
		["쿨러", " cooler "],
		["톤백", " ton bag "],
		["체크", " check "],
		["저압", " low voltage "],

		["판형", " plate type "],
		["플라스틱", " plastic "],
		["티타늄", " titanium "],
		["파이프", " pipe "],
		["튜브", " tube "],
		["번들", " bunddle "],
		["피팅", " fitting "],
		["플러그", " plug "],
		["핀튜브", " pin tube "],
		["럽쳐디스크", " rupture disc "],
		["라인드체크", " lined check "],
		["라인드", " lined "],
		["플랜지", " flange "],
		["케이블", " cable "],
		["보일러", " boiler "],
		["전기히터", " electric heater "],
		["호스가스켓", " hose gasket "],
		["반응기", " reactor "],
		["쿨링타워", " cooling tower "],
		["스페어", " spare "],
		["모니터링", " monitoring "],
		["필터", " filter "],
		["온도", " temperature "],
		["진공", " vaccum "],
		["모터", " motor "],
		["유량계", " floemeter "],
		["탱크", " tank "],
		["변압기", " tranformer "],
		["로딩암", " loading arm "],
		["교반기", " mixer "],
		["판넬", " panel "],
		["배관", " piping "],
		["오리피스", " orificr "],
		["열교환기", " heat exchanger "],
		["펌프", " pump "],
		["호스", " hose "],
		["가스켓", " gasket "],
		["배터리", " battery "],
		["터보블로어", " turbo blower "],
		["패키지", " package "],
		["버너", " bunner "],
		["오링", " oring "],
		["인버터", " inverter "],
		["전동valve", " control valve "],
		["호퍼", " hopper "],
		["토너", " tonner "],
		["분석기", " anayzer "],
		["저울", " scale "],
		["컨트롤", " control "],
		["글로브", " glove "],
		["컨트롤벨브", " control valve "],
		["컨트롤밸브", " control valve "],
		["아지테이터", " agitator "],
		["송풍기", " blower "],
		["블로어", " blower "],
		["볼 valve", " ball valve "],
		["fitting류", " fitting "],

		["원심", " centrifugal "],
		["컴프레샤", " compressor "],
		["컴프레셔", " compressor "],
		["압축기", " compressor "],
		["호이스트", " hoist "],
		["메카니카씰", " mechanical seal "],
		["메카니칼", " mechanical "],
		["메카니컬", " mechanical "],
		["밸브", " valve "],
		["벨브", " valve "],
		["그라파이트", " graphite "],
		["언로딩시스템", " unloading system "],
		["플레어스택", " flare stack "],
		["센서", " sensor "],
		["발전기", " generator "],
		["액츄에이터", " actuator "],
		["온오프", " on-off "],
		["질량", " mass "],
		["마그네틱", " magnetic "],
		["임펠러", " impellar "],
		["컨테이너", " container "],
		["전기", " electric "],
		["스크러버", " scrubber "],
		["무정전저원장치", " ups "],
		["mech-seal", " mechanical seal "],
		["메커미널 씰", " mechanical seal "],
		["차저", " changer "],
		["s/parts", " spare parts "],
		["spare 파트", " spare parts "],

	]

class hm_iter:
	def __init__(self, input_list_1d, step=1):
		self.max = len(input_list_1d)
		self.max_index = self.max - step
		self.data = input_list_1d
		self.index = 0
		self.step = step

	def next(self):
		if self.max_index >= self.index:
			result = self.data[self.index:self.index+self.step]
			self.index = self.index +1
		return result